docs/notes/ostep/process.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Process</title>
<meta name="author" content="Tak" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='/css/stylesheet.css'>
</head>
<body>
<div id="nav" class="status">
<a href='/'>bacchanalian madness</a><a href='/rss.xml'>
    <button id='rss-button' aria-label='Get RSS feed' type='button'>
      <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 448 512' fill='currentColor'>
        <path d='M128.081 415.959c0 35.369-28.672 64.041-64.041 64.041S0 451.328 0 415.959s28.672-64.041 64.041-64.041 64.04 28.673 64.04 64.041zm175.66 47.25c-8.354-154.6-132.185-278.587-286.95-286.95C7.656 175.765 0 183.105 0 192.253v48.069c0 8.415 6.49 15.472 14.887 16.018 111.832 7.284 201.473 96.702 208.772 208.772.547 8.397 7.604 14.887 16.018 14.887h48.069c9.149.001 16.489-7.655 15.995-16.79zm144.249.288C439.596 229.677 251.465 40.445 16.503 32.01 7.473 31.686 0 38.981 0 48.016v48.068c0 8.625 6.835 15.645 15.453 15.999 191.179 7.839 344.627 161.316 352.465 352.465.353 8.618 7.373 15.453 15.999 15.453h48.068c9.034-.001 16.329-7.474 16.005-16.504z'></path>
      </svg>
    </button>
  </a><button id='dark-mode-button' aria-label='Toggle Dark Mode' type='button'>
    <svg id='moon-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor'>
      <path d='M17.293 13.293A8 8 0 016.707 2.707a8.001 8.001 0 1010.586 10.586z'></path>
    </svg>
    <svg id='sun-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor' style='display: none;'>
      <path d='M10 2a1 1 0 011 1v1a1 1 0 11-2 0V3a1 1 0 011-1zm4 8a4 4 0 11-8 0 4 4 0 018 0zm-.464 4.95l.707.707a1 1 0 001.414-1.414l-.707-.707a1 1 0 00-1.414 1.414zm2.12-10.607a1 1 0 010 1.414l-.706.707a1 1 0 11-1.414-1.414l.707-.707a1 1 0 011.414 0zM17 11a1 1 0 100-2h-1a1 1 0 100 2h1zm-7 4a1 1 0 011 1v1a1 1 0 11-2 0v-1a1 1 0 011-1zM5.05 6.464A1 1 0 106.465 5.05l-.708-.707a1 1 0 00-1.414 1.414l.707.707zm1.414 8.486l-.707.707a1 1 0 01-1.414-1.414l.707-.707a1 1 0 011.414 1.414zM4 11a1 1 0 100-2H3a1 1 0 000 2h1z' fill-rule='evenodd' clip-rule='evenodd'></path>
    </svg>
  </button>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Process</h1>
<p class="date">2026-02-19 Thu</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#process-api">Process API</a></li>
<li><a href="#process-creation">Process Creation</a></li>
<li><a href="#process-states">Process States</a></li>
<li><a href="#process-data-structures">Process Data Structures</a></li>
<li><a href="#system-calls">System Calls</a></li>
</ul>
</div>
</nav>
<p>As was earlier stated, a <i>process</i> is just a <i>running program</i>. On a computer, there&rsquo;s a limited amount of CPUs that seemingly run hundreds or thousands of processes at the same time. This illusion of limitless CPUs is created by the OS by <b>virtualizing</b> the CPU. It&rsquo;s done by the <i>time sharing</i> mechanism of the CPU, in which the OS runs one process, stops it and switches to a different one providing the illusion that multiple programs are running simultaneously at the cost of performance. On top of this mechanism resides a <b>policy</b> which is an algorithm for making decisions within the OS.
</p>

<div class="note">
<p>A <i>mechanism</i> answers a <i>how</i> question (lower-level mechanism) about a system, whereas the <i>policy</i> provides the answer to a <i>which</i> question (high-level). For example: how does an OS perform a context switch v/s which process should it run right now.
</p>

</div>

<p>It is necessary to understand the <b>machine state</b> of a process to understand what constitutes it. One of the obvious components of the state is the <i>memory</i> that the process can address (aka <b>address space</b>). Also part of the state are the <i>registers</i>: special ones being <i>program counter</i> (PC aka instruction pointer IP), <i>stack pointer</i>, <i>frame pointer</i> etc.
</p>
<div id="outline-container-process-api" class="outline-2">
<h2 id="process-api">Process API</h2>
<div class="outline-text-2" id="text-process-api">
<ul class="org-ul">
<li><b><b>Create</b></b>: New processes.</li>
<li><b><b>Destory</b></b>: Said processes forcefully.</li>
<li><b><b>Wait</b></b>: For graceful exit/completion of processes.</li>
<li><b><b>Miscellaenous Control</b></b>: Process suspension, resuming etc.</li>
<li><b><b>Status</b></b>: How long did a process run for, what&rsquo;s its current state.</li>
</ul>
</div>
</div>
<div id="outline-container-process-creation" class="outline-2">
<h2 id="process-creation">Process Creation</h2>
<div class="outline-text-2" id="text-process-creation">
<p>The first things the OS must do is to <i>load</i> the program code and static data (initialized variables) in memory, into the address space of the process. In early OSes, loading was done <i>eagerly</i> i.e. the entire program was loaded all at once but modern OS do <i>lazy</i> loading where only the pieces of data that&rsquo;s needed is loaded during execution (done via <b>paging/swapping</b>).
</p>

<p>Once the data&rsquo;s loaded, some memory must be allocated for program&rsquo;s <b>stack</b> (used for local variables, function parameters, return addresses). The OS also initializes the stack with arguments i.e. fill parameters to <code>main()</code> function. Then it must also allocate some <b>heap</b> memory, used for explicitly requested dynamically-allocated data.
</p>

<p>The OS must also do I/O related initialization, i.e. setup the three <b>file descriptors</b> for the process to read input from terminal and print output/error to the screen. Once all the setup is done, program <i>execution</i> can begin by jumping to the <code>main()</code> routine, and the control is shifted from CPU to the newly-created process.
</p>
</div>
</div>
<div id="outline-container-process-states" class="outline-2">
<h2 id="process-states">Process States</h2>
<div class="outline-text-2" id="text-process-states">
<p>A process can be in <b>Running</b>, <b>Ready</b> or <b>Blocked</b> state. Moving from <i>Ready</i> to <i>Running</i> means the process has been <b>scheduled</b>, if a running process gets blocked due to I/O, the OS doesn&rsquo;t move it to ready unless the blocking event finishes.
</p>

<pre class="mermaid">
stateDiagram-v2
    Running --> Ready: Descheduled
    Ready --> Running: Scheduled

    Running --> Blocked: I/O initiated
    Blocked --> Ready: I/O done
</pre>
</div>
</div>
<div id="outline-container-process-data-structures" class="outline-2">
<h2 id="process-data-structures">Process Data Structures</h2>
<div class="outline-text-2" id="text-process-data-structures">
<p>OS must have a <b>process list</b> to keep track of state of all processes, which ones are ready/running or blocked. For blocked processes, the I/O events must also be tracked somehow. The <b>register context</b> holds the contents of registers for a <i>stopped</i> process, which can then be used to restore the values in physical registers when running of the process resumes.
</p>

<pre class="src src-C"><code><span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">context</span> {
  <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">eip</span>;
  <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">esp</span>;
  ...
  <span class="font-lock-type-face">int</span> ebp;
};

<span class="font-lock-keyword-face">enum</span> <span class="font-lock-type-face">proc_state</span> { <span class="font-lock-variable-name-face">UNUSED</span>, <span class="font-lock-variable-name-face">EMBRYO</span>, <span class="font-lock-variable-name-face">SLEEPING</span>,
                  <span class="font-lock-variable-name-face">RUNNABLE</span>, <span class="font-lock-variable-name-face">RUNNING</span>, <span class="font-lock-variable-name-face">ZOMBIE</span> };

<span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">proc</span> {
  <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">mem</span>;                  <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Start of proc mem
</span>  <span class="font-lock-type-face">uint</span> <span class="font-lock-variable-name-face">sz</span>;                    <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Size of proc mem
</span>  <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">kstack</span>;               <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Process kernel stack bottom
</span>  <span class="font-lock-keyword-face">enum</span> <span class="font-lock-type-face">proc_state</span> <span class="font-lock-variable-name-face">state</span>;      <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Proc state
</span>  <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">pid</span>;
  <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">proc</span> *<span class="font-lock-variable-name-face">parent</span>;        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Parent process
</span>  <span class="font-lock-type-face">void</span> *<span class="font-lock-variable-name-face">chan</span>;                 <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">If !zero, sleeping on chan
</span>  <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">killed</span>;                 <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">If !zero, has been killed
</span>  <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">file</span> *<span class="font-lock-variable-name-face">ofile</span>[NOFILE]; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Open files
</span>  <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">inode</span> *<span class="font-lock-variable-name-face">cwd</span>;
  <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">context</span> <span class="font-lock-variable-name-face">context</span>;
  <span class="font-lock-keyword-face">struct</span> <span class="font-lock-type-face">trapframe</span> *<span class="font-lock-variable-name-face">tf</span>;       <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Trap frame for current interrupt
</span>};</code></pre>
</div>
