docs/notes/ostep/process.html
<div id="outline-container-system-calls-homework" class="outline-3">
<h3 id="system-calls-homework">Homework</h3>
<div class="outline-text-3" id="text-system-calls-homework">
<p>The below program <code>process-run.py</code> allows for observing how process states change as programs run
</p>

<details>
<summary>process-run.py</summary>

<pre class="src src-python"><code><span class="font-lock-comment-face">#! /usr/bin/env python</span>

<span class="font-lock-keyword-face">from</span> __future__ <span class="font-lock-keyword-face">import</span> print_function
<span class="font-lock-keyword-face">import</span> sys
<span class="font-lock-keyword-face">from</span> optparse <span class="font-lock-keyword-face">import</span> <span class="font-lock-type-face">OptionParser</span>
<span class="font-lock-keyword-face">import</span> random

<span class="font-lock-comment-face"># to make Python2 and Python3 act the same -- how dumb</span>
<span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">random_seed</span>(<span class="font-lock-variable-name-face">seed</span>):
    <span class="font-lock-keyword-face">try</span>:
        random.seed(seed, version=<span class="font-lock-number-face">1</span>)
    <span class="font-lock-keyword-face">except</span>:
        random.seed(seed)
    <span class="font-lock-keyword-face">return</span>

<span class="font-lock-comment-face"># process switch behavior</span>
<span class="font-lock-constant-face">SCHED_SWITCH_ON_IO</span> = <span class="font-lock-string-face">'SWITCH_ON_IO'</span>
<span class="font-lock-constant-face">SCHED_SWITCH_ON_END</span> = <span class="font-lock-string-face">'SWITCH_ON_END'</span>

<span class="font-lock-comment-face"># io finished behavior</span>
<span class="font-lock-constant-face">IO_RUN_LATER</span> = <span class="font-lock-string-face">'IO_RUN_LATER'</span>
<span class="font-lock-constant-face">IO_RUN_IMMEDIATE</span> = <span class="font-lock-string-face">'IO_RUN_IMMEDIATE'</span>

<span class="font-lock-comment-face"># process states</span>
<span class="font-lock-constant-face">STATE_RUNNING</span> = <span class="font-lock-string-face">'RUNNING'</span>
<span class="font-lock-constant-face">STATE_READY</span> = <span class="font-lock-string-face">'READY'</span>
<span class="font-lock-constant-face">STATE_DONE</span> = <span class="font-lock-string-face">'DONE'</span>
<span class="font-lock-constant-face">STATE_WAIT</span> = <span class="font-lock-string-face">'BLOCKED'</span>

<span class="font-lock-comment-face"># members of process structure</span>
<span class="font-lock-constant-face">PROC_CODE</span> = <span class="font-lock-string-face">'code_'</span>
<span class="font-lock-constant-face">PROC_PC</span> = <span class="font-lock-string-face">'pc_'</span>
<span class="font-lock-constant-face">PROC_ID</span> = <span class="font-lock-string-face">'pid_'</span>
<span class="font-lock-constant-face">PROC_STATE</span> = <span class="font-lock-string-face">'proc_state_'</span>

<span class="font-lock-comment-face"># things a process can do</span>
<span class="font-lock-constant-face">DO_COMPUTE</span> = <span class="font-lock-string-face">'cpu'</span>
<span class="font-lock-constant-face">DO_IO</span> = <span class="font-lock-string-face">'io'</span>
<span class="font-lock-constant-face">DO_IO_DONE</span> = <span class="font-lock-string-face">'io_done'</span>


<span class="font-lock-keyword-face">class</span> <span class="font-lock-type-face">scheduler</span>:
    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">__init__</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">process_switch_behavior</span>, <span class="font-lock-variable-name-face">io_done_behavior</span>, <span class="font-lock-variable-name-face">io_length</span>):
        <span class="font-lock-comment-face"># keep set of instructions for each of the processes</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">proc_info</span> = {}
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">process_switch_behavior</span> = process_switch_behavior
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">io_done_behavior</span> = io_done_behavior
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">io_length</span> = io_length
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">new_process</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-variable-name-face">proc_id</span> = <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)
        <span class="font-lock-keyword-face">self</span>.proc_info[proc_id] = {}
        <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_PC] = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_ID] = proc_id
        <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE] = []
        <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_STATE] = <span class="font-lock-constant-face">STATE_READY</span>
        <span class="font-lock-keyword-face">return</span> proc_id

    <span class="font-lock-comment-face"># program looks like this:</span>
    <span class="font-lock-comment-face">#   c7,i,c1,i</span>
    <span class="font-lock-comment-face"># which means</span>
    <span class="font-lock-comment-face">#   compute for 7, then i/o, then compute for 1, then i/o</span>
    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">load_program</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">program</span>):
        <span class="font-lock-variable-name-face">proc_id</span> = <span class="font-lock-keyword-face">self</span>.new_process()
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">line</span> <span class="font-lock-keyword-face">in</span> program.split(<span class="font-lock-string-face">','</span>):
            <span class="font-lock-variable-name-face">opcode</span> = line[<span class="font-lock-number-face">0</span>]
            <span class="font-lock-keyword-face">if</span> opcode == <span class="font-lock-string-face">'c'</span>: <span class="font-lock-comment-face"># compute</span>
                <span class="font-lock-variable-name-face">num</span> = int(line[<span class="font-lock-number-face">1</span>:])
                <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">i</span> <span class="font-lock-keyword-face">in</span> range(num):
                    <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_COMPUTE</span>)
            <span class="font-lock-keyword-face">elif</span> opcode == <span class="font-lock-string-face">'i'</span>:
                <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_IO</span>)
                <span class="font-lock-comment-face"># add one compute to HANDLE the I/O completion</span>
                <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_IO_DONE</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'bad opcode %s (should be c or i)'</span> % opcode)
                exit(<span class="font-lock-number-face">1</span>)
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">load</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">program_description</span>):
        <span class="font-lock-variable-name-face">proc_id</span> = <span class="font-lock-keyword-face">self</span>.new_process()
        <span class="font-lock-variable-name-face">tmp</span> = program_description.split(<span class="font-lock-string-face">':'</span>)
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(tmp) != <span class="font-lock-number-face">2</span>:
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Bad description (%s): Must be number &lt;x:y&gt;'</span> % program_description)
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'  where X is the number of instructions'</span>)
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'  and Y is the percent change that an instruction is CPU not IO'</span>)
            exit(<span class="font-lock-number-face">1</span>)

        <span class="font-lock-variable-name-face">num_instructions</span>, <span class="font-lock-variable-name-face">chance_cpu</span> = int(tmp[<span class="font-lock-number-face">0</span>]), float(tmp[<span class="font-lock-number-face">1</span>])/<span class="font-lock-number-face">100.0</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">i</span> <span class="font-lock-keyword-face">in</span> range(num_instructions):
            <span class="font-lock-keyword-face">if</span> random.random() &lt; chance_cpu:
                <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_COMPUTE</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_IO</span>)
                <span class="font-lock-comment-face"># add one compute to HANDLE the I/O completion</span>
                <span class="font-lock-keyword-face">self</span>.proc_info[proc_id][PROC_CODE].append(<span class="font-lock-constant-face">DO_IO_DONE</span>)
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">move_to_ready</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">expected</span>, <span class="font-lock-variable-name-face">pid</span>=-<span class="font-lock-number-face">1</span>):
        <span class="font-lock-keyword-face">if</span> pid == -<span class="font-lock-number-face">1</span>:
            <span class="font-lock-variable-name-face">pid</span> = <span class="font-lock-keyword-face">self</span>.curr_proc
        <span class="font-lock-keyword-face">assert</span>(<span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] == expected)
        <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] = <span class="font-lock-constant-face">STATE_READY</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">move_to_wait</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">expected</span>):
        <span class="font-lock-keyword-face">assert</span>(<span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == expected)
        <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] = <span class="font-lock-constant-face">STATE_WAIT</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">move_to_running</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">expected</span>):
        <span class="font-lock-keyword-face">assert</span>(<span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == expected)
        <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] = <span class="font-lock-constant-face">STATE_RUNNING</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">move_to_done</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">expected</span>):
        <span class="font-lock-keyword-face">assert</span>(<span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == expected)
        <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] = <span class="font-lock-constant-face">STATE_DONE</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">next_proc</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">pid</span>=-<span class="font-lock-number-face">1</span>):
        <span class="font-lock-keyword-face">if</span> pid != -<span class="font-lock-number-face">1</span>:
            <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_proc</span> = pid
            <span class="font-lock-keyword-face">self</span>.move_to_running(<span class="font-lock-constant-face">STATE_READY</span>)
            <span class="font-lock-keyword-face">return</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-keyword-face">self</span>.curr_proc + <span class="font-lock-number-face">1</span>, <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] == STATE_READY:
                <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_proc</span> = pid
                <span class="font-lock-keyword-face">self</span>.move_to_running(<span class="font-lock-constant-face">STATE_READY</span>)
                <span class="font-lock-keyword-face">return</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-number-face">0</span>, <span class="font-lock-keyword-face">self</span>.curr_proc + <span class="font-lock-number-face">1</span>):
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] == STATE_READY:
                <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_proc</span> = pid
                <span class="font-lock-keyword-face">self</span>.move_to_running(<span class="font-lock-constant-face">STATE_READY</span>)
                <span class="font-lock-keyword-face">return</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_num_processes</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_num_instructions</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">pid</span>):
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_CODE])

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_instruction</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">pid</span>, <span class="font-lock-variable-name-face">index</span>):
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_CODE][index]

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_num_active</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-variable-name-face">num_active</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] != STATE_DONE:
                <span class="font-lock-variable-name-face">num_active</span> += <span class="font-lock-number-face">1</span>
        <span class="font-lock-keyword-face">return</span> num_active

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_num_runnable</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-variable-name-face">num_active</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] == STATE_READY <span class="font-lock-keyword-face">or</span> \
                   <span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE] == STATE_RUNNING:
                <span class="font-lock-variable-name-face">num_active</span> += <span class="font-lock-number-face">1</span>
        <span class="font-lock-keyword-face">return</span> num_active

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_ios_in_flight</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">current_time</span>):
        <span class="font-lock-variable-name-face">num_in_flight</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">t</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.io_finish_times[pid]:
                <span class="font-lock-keyword-face">if</span> t &gt; current_time:
                    <span class="font-lock-variable-name-face">num_in_flight</span> += <span class="font-lock-number-face">1</span>
        <span class="font-lock-keyword-face">return</span> num_in_flight

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">check_for_switch</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">space</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">num_columns</span>):
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">i</span> <span class="font-lock-keyword-face">in</span> range(num_columns):
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%10s'</span> % <span class="font-lock-string-face">' '</span>, end=<span class="font-lock-string-face">''</span>)

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">check_if_done</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_CODE]) == <span class="font-lock-number-face">0</span>:
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == STATE_RUNNING:
                <span class="font-lock-keyword-face">self</span>.move_to_done(<span class="font-lock-constant-face">STATE_RUNNING</span>)
                <span class="font-lock-keyword-face">self</span>.next_proc()
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">run</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-variable-name-face">clock_tick</span> = <span class="font-lock-number-face">0</span>

        <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info) == <span class="font-lock-number-face">0</span>:
            <span class="font-lock-keyword-face">return</span>

        <span class="font-lock-comment-face"># track outstanding IOs, per process</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">io_finish_times</span> = {}
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-keyword-face">self</span>.io_finish_times[pid] = []

        <span class="font-lock-comment-face"># make first one active</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_proc</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">self</span>.move_to_running(<span class="font-lock-constant-face">STATE_READY</span>)

        <span class="font-lock-comment-face"># OUTPUT: headers for each column</span>
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%s'</span> % <span class="font-lock-string-face">'Time'</span>, end=<span class="font-lock-string-face">''</span>) 
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % (<span class="font-lock-string-face">'PID:%2d'</span> % (pid)), end=<span class="font-lock-string-face">''</span>)
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % <span class="font-lock-string-face">'CPU'</span>, end=<span class="font-lock-string-face">''</span>)
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % <span class="font-lock-string-face">'IOs'</span>, end=<span class="font-lock-string-face">''</span>)
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)

        <span class="font-lock-comment-face"># init statistics</span>
        <span class="font-lock-variable-name-face">io_busy</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-variable-name-face">cpu_busy</span> = <span class="font-lock-number-face">0</span>

        <span class="font-lock-keyword-face">while</span> <span class="font-lock-keyword-face">self</span>.get_num_active() &gt; <span class="font-lock-number-face">0</span>:
            <span class="font-lock-variable-name-face">clock_tick</span> += <span class="font-lock-number-face">1</span>

            <span class="font-lock-comment-face"># check for io finish</span>
            <span class="font-lock-variable-name-face">io_done</span> = <span class="font-lock-constant-face">False</span>
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
                <span class="font-lock-keyword-face">if</span> clock_tick <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.io_finish_times[pid]:
                    <span class="font-lock-variable-name-face">io_done</span> = <span class="font-lock-constant-face">True</span>
                    <span class="font-lock-keyword-face">self</span>.move_to_ready(<span class="font-lock-constant-face">STATE_WAIT</span>, pid)
                    <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.io_done_behavior == IO_RUN_IMMEDIATE:
                        <span class="font-lock-comment-face"># IO_RUN_IMMEDIATE</span>
                        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.curr_proc != pid:
                            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == STATE_RUNNING:
                                <span class="font-lock-keyword-face">self</span>.move_to_ready(<span class="font-lock-constant-face">STATE_RUNNING</span>)
                        <span class="font-lock-keyword-face">self</span>.next_proc(pid)
                    <span class="font-lock-keyword-face">else</span>:
                        <span class="font-lock-comment-face"># IO_RUN_LATER</span>
                        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.process_switch_behavior == SCHED_SWITCH_ON_END <span class="font-lock-keyword-face">and</span> <span class="font-lock-keyword-face">self</span>.get_num_runnable() &gt; <span class="font-lock-number-face">1</span>:
                            <span class="font-lock-comment-face"># this means the process that issued the io should be run</span>
                            <span class="font-lock-keyword-face">self</span>.next_proc(pid)
                        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.get_num_runnable() == <span class="font-lock-number-face">1</span>:
                            <span class="font-lock-comment-face"># this is the only thing to run: so run it</span>
                            <span class="font-lock-keyword-face">self</span>.next_proc(pid)
                    <span class="font-lock-keyword-face">self</span>.check_if_done()

            <span class="font-lock-comment-face"># if current proc is RUNNING and has an instruction, execute it</span>
            <span class="font-lock-variable-name-face">instruction_to_execute</span> = <span class="font-lock-string-face">''</span>
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_STATE] == STATE_RUNNING <span class="font-lock-keyword-face">and</span> \
                   <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_CODE]) &gt; <span class="font-lock-number-face">0</span>:
                <span class="font-lock-variable-name-face">instruction_to_execute</span> = <span class="font-lock-keyword-face">self</span>.proc_info[<span class="font-lock-keyword-face">self</span>.curr_proc][PROC_CODE].pop(<span class="font-lock-number-face">0</span>)
                <span class="font-lock-variable-name-face">cpu_busy</span> += <span class="font-lock-number-face">1</span>

            <span class="font-lock-comment-face"># OUTPUT: print what everyone is up to</span>
            <span class="font-lock-keyword-face">if</span> io_done:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%3d*'</span> % clock_tick, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%3d '</span> % clock_tick, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(<span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.proc_info)):
                <span class="font-lock-keyword-face">if</span> pid == <span class="font-lock-keyword-face">self</span>.curr_proc <span class="font-lock-keyword-face">and</span> instruction_to_execute != <span class="font-lock-string-face">''</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % (<span class="font-lock-string-face">'RUN:'</span>+instruction_to_execute), end=<span class="font-lock-string-face">''</span>)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % (<span class="font-lock-keyword-face">self</span>.proc_info[pid][PROC_STATE]), end=<span class="font-lock-string-face">''</span>)

            <span class="font-lock-comment-face"># CPU output here: if no instruction executes, output a space, otherwise a 1 </span>
            <span class="font-lock-keyword-face">if</span> instruction_to_execute == <span class="font-lock-string-face">''</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % <span class="font-lock-string-face">' '</span>, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % <span class="font-lock-string-face">'1'</span>, end=<span class="font-lock-string-face">''</span>)

            <span class="font-lock-comment-face"># IO output here:</span>
            <span class="font-lock-variable-name-face">num_outstanding</span> = <span class="font-lock-keyword-face">self</span>.get_ios_in_flight(clock_tick)
            <span class="font-lock-keyword-face">if</span> num_outstanding &gt; <span class="font-lock-number-face">0</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%14s'</span> % str(num_outstanding), end=<span class="font-lock-string-face">''</span>)
                <span class="font-lock-variable-name-face">io_busy</span> += <span class="font-lock-number-face">1</span>
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%10s'</span> % <span class="font-lock-string-face">' '</span>, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)

            <span class="font-lock-comment-face"># if this is an IO start instruction, switch to waiting state</span>
            <span class="font-lock-comment-face"># and add an io completion in the future</span>
            <span class="font-lock-keyword-face">if</span> instruction_to_execute == DO_IO:
                <span class="font-lock-keyword-face">self</span>.move_to_wait(<span class="font-lock-constant-face">STATE_RUNNING</span>)
                <span class="font-lock-keyword-face">self</span>.io_finish_times[<span class="font-lock-keyword-face">self</span>.curr_proc].append(clock_tick + <span class="font-lock-keyword-face">self</span>.io_length + <span class="font-lock-number-face">1</span>)
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.process_switch_behavior == SCHED_SWITCH_ON_IO:
                    <span class="font-lock-keyword-face">self</span>.next_proc()

            <span class="font-lock-comment-face"># ENDCASE: check if currently running thing is out of instructions</span>
            <span class="font-lock-keyword-face">self</span>.check_if_done()
        <span class="font-lock-keyword-face">return</span> (cpu_busy, io_busy, clock_tick)

<span class="font-lock-comment-face">#</span>
<span class="font-lock-comment-face"># PARSE ARGUMENTS</span>
<span class="font-lock-comment-face">#</span>

<span class="font-lock-variable-name-face">parser</span> = <span class="font-lock-type-face">OptionParser</span>()
parser.add_option(<span class="font-lock-string-face">'-s'</span>, <span class="font-lock-string-face">'--seed'</span>, default=<span class="font-lock-number-face">0</span>, help=<span class="font-lock-string-face">'the random seed'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'int'</span>, dest=<span class="font-lock-string-face">'seed'</span>)
parser.add_option(<span class="font-lock-string-face">'-P'</span>, <span class="font-lock-string-face">'--program'</span>, default=<span class="font-lock-string-face">''</span>, help=<span class="font-lock-string-face">'more specific controls over programs'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, dest=<span class="font-lock-string-face">'program'</span>)
parser.add_option(<span class="font-lock-string-face">'-l'</span>, <span class="font-lock-string-face">'--processlist'</span>, default=<span class="font-lock-string-face">''</span>, help=<span class="font-lock-string-face">'a comma-separated list of processes to run, in the form X1:Y1,X2:Y2,... where X is the number of instructions that process should run, and Y the chances (from 0 to 100) that an instruction will use the CPU or issue an IO (i.e., if Y is 100, a process will ONLY use the CPU and issue no I/Os; if Y is 0, a process will only issue I/Os)'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, dest=<span class="font-lock-string-face">'process_list'</span>)
parser.add_option(<span class="font-lock-string-face">'-L'</span>, <span class="font-lock-string-face">'--iolength'</span>, default=<span class="font-lock-number-face">5</span>, help=<span class="font-lock-string-face">'how long an IO takes'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'int'</span>, dest=<span class="font-lock-string-face">'io_length'</span>)
parser.add_option(<span class="font-lock-string-face">'-S'</span>, <span class="font-lock-string-face">'--switch'</span>, default=<span class="font-lock-string-face">'SWITCH_ON_IO'</span>, help=<span class="font-lock-string-face">'when to switch between processes: SWITCH_ON_IO, SWITCH_ON_END'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, dest=<span class="font-lock-string-face">'process_switch_behavior'</span>)
parser.add_option(<span class="font-lock-string-face">'-I'</span>, <span class="font-lock-string-face">'--iodone'</span>, default=<span class="font-lock-string-face">'IO_RUN_LATER'</span>, help=<span class="font-lock-string-face">'type of behavior when IO ends: IO_RUN_LATER, IO_RUN_IMMEDIATE'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, dest=<span class="font-lock-string-face">'io_done_behavior'</span>)
parser.add_option(<span class="font-lock-string-face">'-c'</span>, help=<span class="font-lock-string-face">'compute answers for me'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'solve'</span>)
parser.add_option(<span class="font-lock-string-face">'-p'</span>, <span class="font-lock-string-face">'--printstats'</span>, help=<span class="font-lock-string-face">'print statistics at end; only useful with -c flag (otherwise stats are not printed)'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'print_stats'</span>)
(<span class="font-lock-variable-name-face">options</span>, <span class="font-lock-variable-name-face">args</span>) = parser.parse_args()

random_seed(options.seed)

<span class="font-lock-keyword-face">assert</span>(options.process_switch_behavior == SCHED_SWITCH_ON_IO <span class="font-lock-keyword-face">or</span> options.process_switch_behavior == SCHED_SWITCH_ON_END)
<span class="font-lock-keyword-face">assert</span>(options.io_done_behavior == IO_RUN_IMMEDIATE <span class="font-lock-keyword-face">or</span> options.io_done_behavior == IO_RUN_LATER)

<span class="font-lock-variable-name-face">s</span> = scheduler(options.process_switch_behavior, options.io_done_behavior, options.io_length)

<span class="font-lock-keyword-face">if</span> options.program != <span class="font-lock-string-face">''</span>:
    <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">p</span> <span class="font-lock-keyword-face">in</span> options.program.split(<span class="font-lock-string-face">':'</span>):
        s.load_program(p)
<span class="font-lock-keyword-face">else</span>:
    <span class="font-lock-comment-face"># example process description (10:100,10:100)</span>
    <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">p</span> <span class="font-lock-keyword-face">in</span> options.process_list.split(<span class="font-lock-string-face">','</span>):
        s.load(p)

<span class="font-lock-keyword-face">assert</span>(options.io_length &gt;= <span class="font-lock-number-face">0</span>)

<span class="font-lock-keyword-face">if</span> options.solve == <span class="font-lock-constant-face">False</span>:
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Produce a trace of what would happen when you run these processes:'</span>)
    <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">pid</span> <span class="font-lock-keyword-face">in</span> range(s.get_num_processes()):
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Process %d'</span> % pid)
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">inst</span> <span class="font-lock-keyword-face">in</span> range(s.get_num_instructions(pid)):
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'  %s'</span> % s.get_instruction(pid, inst))
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Important behaviors:'</span>)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'  System will switch when '</span>, end=<span class="font-lock-string-face">''</span>)
    <span class="font-lock-keyword-face">if</span> options.process_switch_behavior == SCHED_SWITCH_ON_IO:
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'the current process is FINISHED or ISSUES AN IO'</span>)
    <span class="font-lock-keyword-face">else</span>:
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'the current process is FINISHED'</span>)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'  After IOs, the process issuing the IO will '</span>, end=<span class="font-lock-string-face">''</span>)
    <span class="font-lock-keyword-face">if</span> options.io_done_behavior == IO_RUN_IMMEDIATE:
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'run IMMEDIATELY'</span>)
    <span class="font-lock-keyword-face">else</span>:
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'run LATER (when it is its turn)'</span>)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
    exit(<span class="font-lock-number-face">0</span>)

(<span class="font-lock-variable-name-face">cpu_busy</span>, <span class="font-lock-variable-name-face">io_busy</span>, <span class="font-lock-variable-name-face">clock_tick</span>) = s.run()

<span class="font-lock-keyword-face">if</span> options.print_stats:
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Stats: Total Time %d'</span> % clock_tick)
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Stats: CPU Busy %d (%.2f%%)'</span> % (cpu_busy, <span class="font-lock-number-face">100.0</span> * float(cpu_busy)/clock_tick))
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Stats: IO Busy  %d (%.2f%%)'</span> % (io_busy, <span class="font-lock-number-face">100.0</span> * float(io_busy)/clock_tick))
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)</code></pre>
</details>

<pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">'-l': 'a comma-separated list of processes to run, in the form X1:Y1,X2:Y2,...
</span><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">where X is the number of instructions that process should run
</span><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">Y the chances (from 0 to 100) that an instruction will use the CPU or issue an IO
</span><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">i.e., if Y is 100, a process will ONLY use the CPU and issue no I/Os;
</span><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">if Y is 0, a process will only issue I/Os
</span>
python process-run.py -l 5:100,5:100 -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1        RUN:cpu         READY             1          
  2        RUN:cpu         READY             1          
  3        RUN:cpu         READY             1          
  4        RUN:cpu         READY             1          
  5        RUN:cpu         READY             1          
  6           DONE       RUN:cpu             1          
  7           DONE       RUN:cpu             1          
  8           DONE       RUN:cpu             1          
  9           DONE       RUN:cpu             1          
 10           DONE       RUN:cpu             1          

Stats: Total Time 10
Stats: CPU Busy 10 (100.00%)
Stats: IO Busy  0 (0.00%)

</pre>

</details><pre class="src src-sh"><code>python process-run.py -l 4:100,1:0 -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1        RUN:cpu         READY             1          
  2        RUN:cpu         READY             1          
  3        RUN:cpu         READY             1          
  4        RUN:cpu         READY             1          
  5           DONE        RUN:io             1          
  6           DONE       BLOCKED                           1
  7           DONE       BLOCKED                           1
  8           DONE       BLOCKED                           1
  9           DONE       BLOCKED                           1
 10           DONE       BLOCKED                           1
 11*          DONE   RUN:io_done             1          

Stats: Total Time 11
Stats: CPU Busy 6 (54.55%)
Stats: IO Busy  5 (45.45%)

</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">switching the order changes the total time taken
</span>
python process-run.py -l 1:0,4:100 -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1         RUN:io         READY             1          
  2        BLOCKED       RUN:cpu             1             1
  3        BLOCKED       RUN:cpu             1             1
  4        BLOCKED       RUN:cpu             1             1
  5        BLOCKED       RUN:cpu             1             1
  6        BLOCKED          DONE                           1
  7*   RUN:io_done          DONE             1          

Stats: Total Time 7
Stats: CPU Busy 6 (85.71%)
Stats: IO Busy  5 (71.43%)

</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-S determines how system reacts when process issues I/O
</span>
python process-run.py -l 1:0,4:100 -c -S SWITCH_ON_END</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1         RUN:io         READY             1          
  2        BLOCKED         READY                           1
  3        BLOCKED         READY                           1
  4        BLOCKED         READY                           1
  5        BLOCKED         READY                           1
  6        BLOCKED         READY                           1
  7*   RUN:io_done         READY             1          
  8           DONE       RUN:cpu             1          
  9           DONE       RUN:cpu             1          
 10           DONE       RUN:cpu             1          
 11           DONE       RUN:cpu             1          
</pre>

</details><pre class="src src-sh"><code>python process-run.py -l 1:0,4:100 -c -S SWITCH_ON_IO</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1         RUN:io         READY             1          
  2        BLOCKED       RUN:cpu             1             1
  3        BLOCKED       RUN:cpu             1             1
  4        BLOCKED       RUN:cpu             1             1
  5        BLOCKED       RUN:cpu             1             1
  6        BLOCKED          DONE                           1
  7*   RUN:io_done          DONE             1          
</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-I defines the type of behavior when IO ends
</span>
python process-run.py -l 3:0,5:100,5:100,5:100 -S SWITCH_ON_IO -I IO_RUN_LATER -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1        PID: 2        PID: 3           CPU           IOs
  1         RUN:io         READY         READY         READY             1          
  2        BLOCKED       RUN:cpu         READY         READY             1             1
  3        BLOCKED       RUN:cpu         READY         READY             1             1
  4        BLOCKED       RUN:cpu         READY         READY             1             1
  5        BLOCKED       RUN:cpu         READY         READY             1             1
  6        BLOCKED       RUN:cpu         READY         READY             1             1
  7*         READY          DONE       RUN:cpu         READY             1          
  8          READY          DONE       RUN:cpu         READY             1          
  9          READY          DONE       RUN:cpu         READY             1          
 10          READY          DONE       RUN:cpu         READY             1          
 11          READY          DONE       RUN:cpu         READY             1          
 12          READY          DONE          DONE       RUN:cpu             1          
 13          READY          DONE          DONE       RUN:cpu             1          
 14          READY          DONE          DONE       RUN:cpu             1          
 15          READY          DONE          DONE       RUN:cpu             1          
 16          READY          DONE          DONE       RUN:cpu             1          
 17    RUN:io_done          DONE          DONE          DONE             1          
 18         RUN:io          DONE          DONE          DONE             1          
 19        BLOCKED          DONE          DONE          DONE                           1
 20        BLOCKED          DONE          DONE          DONE                           1
 21        BLOCKED          DONE          DONE          DONE                           1
 22        BLOCKED          DONE          DONE          DONE                           1
 23        BLOCKED          DONE          DONE          DONE                           1
 24*   RUN:io_done          DONE          DONE          DONE             1          
 25         RUN:io          DONE          DONE          DONE             1          
 26        BLOCKED          DONE          DONE          DONE                           1
 27        BLOCKED          DONE          DONE          DONE                           1
 28        BLOCKED          DONE          DONE          DONE                           1
 29        BLOCKED          DONE          DONE          DONE                           1
 30        BLOCKED          DONE          DONE          DONE                           1
 31*   RUN:io_done          DONE          DONE          DONE             1          

Stats: Total Time 31
Stats: CPU Busy 21 (67.74%)
Stats: IO Busy  15 (48.39%)

</pre>

</details><pre class="src src-sh"><code>python process-run.py -l 3:0,5:100,5:100,5:100 -S SWITCH_ON_IO -I IO_RUN_IMMEDIATE -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1        PID: 2        PID: 3           CPU           IOs
  1         RUN:io         READY         READY         READY             1          
  2        BLOCKED       RUN:cpu         READY         READY             1             1
  3        BLOCKED       RUN:cpu         READY         READY             1             1
  4        BLOCKED       RUN:cpu         READY         READY             1             1
  5        BLOCKED       RUN:cpu         READY         READY             1             1
  6        BLOCKED       RUN:cpu         READY         READY             1             1
  7*   RUN:io_done          DONE         READY         READY             1          
  8         RUN:io          DONE         READY         READY             1          
  9        BLOCKED          DONE       RUN:cpu         READY             1             1
 10        BLOCKED          DONE       RUN:cpu         READY             1             1
 11        BLOCKED          DONE       RUN:cpu         READY             1             1
 12        BLOCKED          DONE       RUN:cpu         READY             1             1
 13        BLOCKED          DONE       RUN:cpu         READY             1             1
 14*   RUN:io_done          DONE          DONE         READY             1          
 15         RUN:io          DONE          DONE         READY             1          
 16        BLOCKED          DONE          DONE       RUN:cpu             1             1
 17        BLOCKED          DONE          DONE       RUN:cpu             1             1
 18        BLOCKED          DONE          DONE       RUN:cpu             1             1
 19        BLOCKED          DONE          DONE       RUN:cpu             1             1
 20        BLOCKED          DONE          DONE       RUN:cpu             1             1
 21*   RUN:io_done          DONE          DONE          DONE             1          

Stats: Total Time 21
Stats: CPU Busy 21 (100.00%)
Stats: IO Busy  15 (71.43%)

</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-s is the seed
</span>
python process-run.py -s 1 -l 3:50,3:50 -c -p
python process-run.py -s 2 -l 3:50,3:50 -c -p
python process-run.py -s 3 -l 3:50,3:50 -c -p</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
Time        PID: 0        PID: 1           CPU           IOs
  1        RUN:cpu         READY             1          
  2         RUN:io         READY             1          
  3        BLOCKED       RUN:cpu             1             1
  4        BLOCKED       RUN:cpu             1             1
  5        BLOCKED       RUN:cpu             1             1
  6        BLOCKED          DONE                           1
  7        BLOCKED          DONE                           1
  8*   RUN:io_done          DONE             1          
  9         RUN:io          DONE             1          
 10        BLOCKED          DONE                           1
 11        BLOCKED          DONE                           1
 12        BLOCKED          DONE                           1
 13        BLOCKED          DONE                           1
 14        BLOCKED          DONE                           1
 15*   RUN:io_done          DONE             1          

Stats: Total Time 15
Stats: CPU Busy 8 (53.33%)
Stats: IO Busy  10 (66.67%)

Time        PID: 0        PID: 1           CPU           IOs
  1         RUN:io         READY             1          
  2        BLOCKED       RUN:cpu             1             1
  3        BLOCKED        RUN:io             1             1
  4        BLOCKED       BLOCKED                           2
  5        BLOCKED       BLOCKED                           2
  6        BLOCKED       BLOCKED                           2
  7*   RUN:io_done       BLOCKED             1             1
  8         RUN:io       BLOCKED             1             1
  9*       BLOCKED   RUN:io_done             1             1
 10        BLOCKED        RUN:io             1             1
 11        BLOCKED       BLOCKED                           2
 12        BLOCKED       BLOCKED                           2
 13        BLOCKED       BLOCKED                           2
 14*   RUN:io_done       BLOCKED             1             1
 15        RUN:cpu       BLOCKED             1             1
 16*          DONE   RUN:io_done             1          

Stats: Total Time 16
Stats: CPU Busy 10 (62.50%)
Stats: IO Busy  14 (87.50%)

Time        PID: 0        PID: 1           CPU           IOs
  1        RUN:cpu         READY             1          
  2         RUN:io         READY             1          
  3        BLOCKED        RUN:io             1             1
  4        BLOCKED       BLOCKED                           2
  5        BLOCKED       BLOCKED                           2
  6        BLOCKED       BLOCKED                           2
  7        BLOCKED       BLOCKED                           2
  8*   RUN:io_done       BLOCKED             1             1
  9*       RUN:cpu         READY             1          
 10           DONE   RUN:io_done             1          
 11           DONE        RUN:io             1          
 12           DONE       BLOCKED                           1
 13           DONE       BLOCKED                           1
 14           DONE       BLOCKED                           1
 15           DONE       BLOCKED                           1
 16           DONE       BLOCKED                           1
 17*          DONE   RUN:io_done             1          
 18           DONE       RUN:cpu             1          

Stats: Total Time 18
Stats: CPU Busy 9 (50.00%)
Stats: IO Busy  11 (61.11%)

</pre>

</details>
</div>
</div>
</div>
