docs/notes/ostep/process.html
<div id="outline-container-system-calls" class="outline-2">
<h2 id="system-calls">System Calls</h2>
<div class="outline-text-2" id="text-system-calls">
<p>Upon <code>fork()</code> ing, the child isn&rsquo;t an <i>exact</i> copy so it has its own address space and the value it returns to the caller is different. (Mandatory read: <a href="https://dl.acm.org/doi/epdf/10.1145/3317550.3321435">A fork() in the road: Baumann et al.</a>)
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    printf(<span class="font-lock-string-face">"hello world (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
    fflush(stdout); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Without flushing, the child was getting copy of stdout buffer
</span>    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();
    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) {
        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">fork failed
</span>        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) {
        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child (new process)
</span>        printf(<span class="font-lock-string-face">"hello, I am child (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
    } <span class="font-lock-keyword-face">else</span> {
        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">parent goes down this path (main)
</span>        printf(<span class="font-lock-string-face">"hello, I am parent of %d (pid: %d)\n"</span>, rc, (<span class="font-lock-type-face">int</span>) getpid());
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello world (pid: 86839)
hello, I am parent of 86840 (pid: 86839)
hello, I am child (pid: 86840)
</pre>


<p>While the parent receives PID of newly-created child, the child receives <code>rc</code> 0. (<del>Why does the second hello world also refer to the parent <code>pid</code> in its &ldquo;hello world&rdquo;?</del> Fixed by flushing the output, without this the child process was getting a copy of the buffered <code>stdout</code>)
</p>

<pre class="src src-sh"><code>man posix_spawn | col -b</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
POSIX_SPAWN(2)		      System Calls Manual		POSIX_SPAWN(2)

NAME
     posix_spawn posix_spawnp – spawn a process

SYNOPSIS
     #include &lt;spawn.h&gt;

     int
     posix_spawn(pid_t *restrict pid, const char *restrict path,
	 const posix_spawn_file_actions_t *file_actions,
	 const posix_spawnattr_t *restrict attrp, char *const argv[restrict],
	 char *const envp[restrict]);

     int
     posix_spawnp(pid_t *restrict pid, const char *restrict file,
	 const posix_spawn_file_actions_t *file_actions,
	 const posix_spawnattr_t *restrict attrp, char *const argv[restrict],
	 char *const envp[restrict]);

DESCRIPTION
     The posix_spawn() function creates a new process from the executable
     file, called the new process file, specified by path, which is an
     absolute or relative path to the file.  The posix_spawnp() function is
     identical to the posix_spawn() function if the file specified contains a
     slash character; otherwise, the file parameter is used to construct a
     pathname, with its path prefix being obtained by a search of the path
     specified in the environment by the “PATH variable”.  If this variable
     isn't specified, the default path is set according to the _PATH_DEFPATH
     definition in &lt;paths.h&gt;, which is set to “/usr/bin:/bin”.	This pathname
     either refers to an executable object file, or a file of data for an
     interpreter; execve(2) for more details.

     The argument pid is a pointer to a pid_t variable to receive the pid of
     the spawned process; if this is NULL, then the pid of the spawned process
     is not returned.  If this pointer is non-NULL, then on successful
     completion, the variable will be modified to contain the pid of the
     spawned process.  The value is undefined in the case of a failure.

     The argument file_actions is either NULL, or it is a pointer to a file
     actions object that was initialized by a call to
     posix_spawn_file_actions_init(3) and represents zero or more file
     actions.

     File descriptors open in the calling process image remain open in the new
     process image, except for those for which the close-on-exec flag is set
     (see close(2) and fcntl(2)).  Descriptors that remain open are unaffected
     by posix_spawn() unless their behaviour is modified by particular spawn
     flags or a file action; see posix_spawnattr_setflags(3) and
     posix_spawn_file_actions_init(3) for additional information.

     The argument attrp is either NULL, or it is a pointer to an attributes
     object that was initialized by a call to posix_spawnattr_init(3) and
     represents a set of spawn attributes to apply.  If NULL, then the default
     attributes are applied; otherwise, these attributes can control various
     aspects of the spawned process, and are applied prior to the spawned
     process beginning execution; see posix_spawnattr_init(3) for more
     information.

     The argument argv is a pointer to a null-terminated array of character
     pointers to null-terminated character strings.  These strings construct
     the argument list to be made available to the new process.  At least
     argv[0] must be present in the array, and should contain the file name of
     the program being spawned, e.g. the last component of the path or file
     argument.

     The argument envp is a pointer to a null-terminated array of character
     pointers to null-terminated strings.  A pointer to this array is normally
     stored in the global variable environ. These strings pass information to
     the new process that is not directly an argument to the command (see
     environ(7)).

     Signals set to be ignored in the calling process are set to be ignored in
     the new process, unless the behaviour is modified by user specified spawn
     attributes.  Signals which are set to be caught in the calling process
     image are set to default action in the new process image.	Blocked
     signals remain blocked regardless of changes to the signal action, unless
     the mask is overridden by user specified spawn attributes.  The signal
     stack is reset to be undefined (see sigaction(2) for more information).

     By default, the effective user ID and group ID will be the same as those
     of the calling process image; however, this may be overridden to force
     them to be the real user ID and group ID of the parent process by user
     specified spawn attributes (see posix_spawnattr_init(3) for more
     information).

     If the set-user-ID mode bit of the new process image file is set (see
     chmod(2)), the effective user ID of the new process image is set to the
     owner ID of the new process image file.  If the set-group-ID mode bit of
     the new process image file is set, the effective group ID of the new
     process image is set to the group ID of the new process image file.  (The
     effective group ID is the first element of the group list.)  The real
     user ID, real group ID and supplementary group IDs of the new process
     image remain the same as the calling process image.  After any set-user-
     ID and set-group-ID processing, the effective user ID is recorded as the
     saved set-user-ID, and the effective group ID is recorded as the saved
     set-group-ID.  These values may be used in changing the effective IDs
     later (see setuid(2)).

     The new process also inherits the following attributes from the calling
     process:

	   parent process ID	see getppid(2)
	   process group ID	see getpgrp(2), posix_spawnattr_init(3)
	   access groups	see getgroups(2)
	   working directory	see chdir(2)
	   root directory	see chroot(2)
	   control terminal	see termios(4)
	   resource usages	see getrusage(2)
	   interval timers	see getitimer(2)
	   resource limits	see getrlimit(2)
	   file mode mask	see umask(2)
	   signal mask		see sigaction(2), sigsetmask(2),
				posix_spawnattr_init(3)

     When a program is executed as a result of a posix_spawn() or
     posix_spawnp() call, it is entered as follows:

	   int
	   main(int argc, char **argv, char **envp);

     where argc is the number of elements in argv (the ``arg count'') and argv
     points to the array of character pointers to the arguments themselves.

RETURN VALUES
     If the pid argument is NULL, no pid is returned to the calling process;
     if it is non-NULL, then posix_spawn() and posix_spawnp() functions return
     the process ID of the child process into the pid_t variable pointed to by
     the pid argument and return a 0 on success.  If an error occurs, they
     return a non-zero error code as the function return value, and no child
     process is created.

ERRORS
     The posix_spawn() and posix_spawnp() functions will fail and return to
     the calling process if:

     [EINVAL]		The value specified by file_actions or attrp is
			invalid.

     [E2BIG]		The number of bytes in the new process's argument list
			is larger than the system-imposed limit.  This limit
			is specified by the sysctl(3) MIB variable
			KERN_ARGMAX.

     [EACCES]		Search permission is denied for a component of the
			path prefix.

     [EACCES]		The new process file is not an ordinary file.

     [EACCES]		The new process file mode denies execute permission.

     [EACCES]		The new process file is on a filesystem mounted with
			execution disabled (MNT_NOEXEC in ⟨sys/mount.h⟩).

     [EFAULT]		The new process file is not as long as indicated by
			the size values in its header.

     [EFAULT]		Path, argv, or envp point to an illegal address.

     [EIO]		An I/O error occurred while reading from the file
			system.

     [ELOOP]		Too many symbolic links were encountered in
			translating the pathname.  This is taken to be
			indicative of a looping symbolic link.

     [ENAMETOOLONG]	A component of a pathname exceeded {NAME_MAX}
			characters, or an entire path name exceeded {PATH_MAX}
			characters.

     [ENOENT]		The new process file does not exist.

     [ENOEXEC]		The new process file has the appropriate access
			permission, but has an unrecognized format (e.g., an
			invalid magic number in its header).

     [ENOMEM]		The new process requires more virtual memory than is
			allowed by the imposed maximum (getrlimit(2)).

     [ENOTDIR]		A component of the path prefix is not a directory.

     [ETXTBSY]		The new process file is a pure procedure (shared text)
			file that is currently open for writing or reading by
			some process.

     [EBADARCH] 	The new process file has no architectures appropriate
			for the current system.

     [EBADF]		Bad file descriptor for one or more file_actions.

     Additionally, they may fail for any of the reasons listed in fork(2) or
     exec(3).

CAVEAT
     If a program is setuid to a non-super-user, but is executed when the real
     uid is ``root'', then the program has some of the powers of a super-user
     as well.

SEE ALSO
     exit(2), fork(2), execl(3), sysctl(3), environ(7),
     posix_spawnattr_init(3), posix_spawn_file_actions_init(3),

STANDARDS
     Version 3 of the Single UNIX Specification (“SUSv3”) [SPN]

HISTORY
     The posix_spawn() and posix_spawnp() function calls appeared in Version 3
     of the Single UNIX Specification (“SUSv3”) [SPN].

Mac OS X		       November 2, 2010 		      Mac OS X
</pre>


</details><p>Sometimes its useful for parent to <code>wait()</code> for child process to finish. In the below program, the child will print first, thus introducing a bit of <i>determinism</i>.
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/wait.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    printf(<span class="font-lock-string-face">"hello world (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
    fflush(stdout); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Without flushing, the child was getting copy of stdout buffer
</span>    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();
    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">fork failed; exit
</span>        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child (new process)
</span>        printf(<span class="font-lock-string-face">"hello, I am child (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
    } <span class="font-lock-keyword-face">else</span> { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">parent goes down this path (main)
</span>        <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc_wait</span> = wait(<span class="font-lock-constant-face">NULL</span>);
        printf(<span class="font-lock-string-face">"hello, I am parent of %d (rc_wait: %d) (pid: %d)\n"</span>,
               rc, rc_wait, (<span class="font-lock-type-face">int</span>) getpid());
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello world (pid: 86584)
hello, I am child (pid: 86586)
hello, I am parent of 86586 (rc_wait: 86586) (pid: 86584)
</pre>


<p>The <code>exec()</code> syscall if useful when one wants to run a program different from the calling program. Here <code>execvp()</code> runs <code>wc</code> which shows how many lines, words and bytes are in <code>process-run.py</code>.
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;string.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/wait.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    printf(<span class="font-lock-string-face">"hello world (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
    fflush(stdout); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Without flushing, the child was getting copy of stdout buffer
</span>    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();
    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">fork failed; exit
</span>        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child (new process)
</span>        printf(<span class="font-lock-string-face">"hello, I am child (pid: %d)\n"</span>, (<span class="font-lock-type-face">int</span>) getpid());
        fflush(stdout); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Always flush!
</span>        <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">myargs</span>[3];
        myargs[0] = strdup(<span class="font-lock-string-face">"wc"</span>);
        myargs[1] = strdup(<span class="font-lock-string-face">"process-run.py"</span>);
        myargs[2] = <span class="font-lock-constant-face">NULL</span>; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">marks end of array
</span>        execvp(myargs[0], myargs); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">runs `wc`
</span>    } <span class="font-lock-keyword-face">else</span> { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">parent goes down this path (main)
</span>        <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc_wait</span> = wait(<span class="font-lock-constant-face">NULL</span>);
        printf(<span class="font-lock-string-face">"hello, I am parent of %d (rc_wait: %d) (pid: %d)\n"</span>,
               rc, rc_wait, (<span class="font-lock-type-face">int</span>) getpid());
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello world (pid: 2019)
hello, I am child (pid: 2020)
  342  1174 13351 process-run.py
hello, I am parent of 2020 (rc_wait: 2020) (pid: 2019)
</pre>


<p>Here the <code>exec()</code> call, <b>loads</b> code (and static data) from the executable passed to it and overwrites its current code segment (and current static data) with the loaded one; the heap/stack and other parts of memory space of program are re-initialized and the OS just runs the new program. It doesn&rsquo;t even create a new process, just transforms the existing one (<code>fork_wait_exec_p3</code>) into the exec&rsquo;d program (<code>wc</code>).
</p>

<pre class="src src-sh"><code>man execve | col -b</code></pre>

<details>
<summary>Output</summary>
<pre class="example">
EXECVE(2)		      System Calls Manual		     EXECVE(2)

NAME
     execve – execute a file

SYNOPSIS
     #include &lt;unistd.h&gt;

     int
     execve(const char *path, char *const argv[], char *const envp[]);

DESCRIPTION
     execve() transforms the calling process into a new process.  The new
     process is constructed from an ordinary file, whose name is pointed to by
     path, called the new process file.  This file is either an executable
     object file, or a file of data for an interpreter.  An executable object
     file consists of an identifying header, followed by pages of data
     representing the initial program (text) and initialized data pages.
     Additional pages may be specified by the header to be initialized with
     zero data;  see a.out(5).

     An interpreter file begins with a line of the form:

	   #! interpreter [arg ...]

     When an interpreter file is execve()'d, the system runs the specified
     interpreter.  If any optional args are specified, they become the first
     (second, ...) argument to the interpreter. The name of the originally
     execve()'d file becomes the subsequent argument; otherwise, the name of
     the originally execve()'d file is the first argument.  The original
     arguments to the invocation of the interpreter are shifted over to become
     the final arguments.  The zeroth argument, normally the name of the
     execve()'d file, is left unchanged.

     The argument argv is a pointer to a null-terminated array of character
     pointers to null-terminated character strings.  These strings construct
     the argument list to be made available to the new process.  At least one
     argument must be present in the array; by custom, the first element
     should be the name of the executed program (for example, the last
     component of path).

     The argument envp is also a pointer to a null-terminated array of
     character pointers to null-terminated strings.  A pointer to this array
     is normally stored in the global variable environ. These strings pass
     information to the new process that is not directly an argument to the
     command (see environ(7)).

     File descriptors open in the calling process image remain open in the new
     process image, except for those for which the close-on-exec flag is set
     (see close(2) and fcntl(2)).  Descriptors that remain open are unaffected
     by execve().

     Signals set to be ignored in the calling process are set to be ignored in
     the new process. Signals which are set to be caught in the calling
     process image are set to default action in the new process image.
     Blocked signals remain blocked regardless of changes to the signal
     action.  The signal stack is reset to be undefined (see sigaction(2) for
     more information).

     If the set-user-ID mode bit of the new process image file is set (see
     chmod(2)), the effective user ID of the new process image is set to the
     owner ID of the new process image file.  If the set-group-ID mode bit of
     the new process image file is set, the effective group ID of the new
     process image is set to the group ID of the new process image file.  (The
     effective group ID is the first element of the group list.)  The real
     user ID, real group ID and other group IDs of the new process image
     remain the same as the calling process image.  After any set-user-ID and
     set-group-ID processing, the effective user ID is recorded as the saved
     set-user-ID, and the effective group ID is recorded as the saved set-
     group-ID.	These values may be used in changing the effective IDs later
     (see setuid(2)).

     The new process also inherits the following attributes from the calling
     process:

	   process ID		see getpid(2)
	   parent process ID	see getppid(2)
	   process group ID	see getpgrp(2)
	   access groups	see getgroups(2)
	   working directory	see chdir(2)
	   root directory	see chroot(2)
	   control terminal	see termios(4)
	   resource usages	see getrusage(2)
	   interval timers	see getitimer(2)
	   resource limits	see getrlimit(2)
	   file mode mask	see umask(2)
	   signal mask		see sigaction(2), sigsetmask(2)

     When a program is executed as a result of an execve() call, it is entered
     as follows:

	   int
	   main(int argc, char **argv, char **envp);

     where argc is the number of elements in argv (the ``arg count'') and argv
     points to the array of character pointers to the arguments themselves.

RETURN VALUES
     As the execve() function overlays the current process image  with a new
     process image, the successful call has no process to return to.  If
     execve() does return to the calling process, an error has occurred; the
     return value will be -1 and the global variable errno is set to indicate
     the error.

ERRORS
     execve() will fail and return to the calling process if:

     [E2BIG]		The number of bytes in the new process's argument list
			is larger than the system-imposed limit.  This limit
			is specified by the sysctl(3) MIB variable
			KERN_ARGMAX.

     [EACCES]		Search permission is denied for a component of the
			path prefix.

     [EACCES]		The new process file is not an ordinary file.

     [EACCES]		The new process file mode denies execute permission.

     [EACCES]		The new process file is on a filesystem mounted with
			execution disabled (MNT_NOEXEC in ⟨sys/mount.h⟩).

     [EFAULT]		The new process file is not as long as indicated by
			the size values in its header.

     [EFAULT]		Path, argv, or envp point to an illegal address.

     [EIO]		An I/O error occurred while reading from the file
			system.

     [ELOOP]		Too many symbolic links were encountered in
			translating the pathname.  This is taken to be
			indicative of a looping symbolic link.

     [ENAMETOOLONG]	A component of a pathname exceeded {NAME_MAX}
			characters, or an entire path name exceeded {PATH_MAX}
			characters.

     [ENOENT]		The new process file does not exist.

     [ENOEXEC]		The new process file has the appropriate access
			permission, but has an unrecognized format (e.g., an
			invalid magic number in its header).

     [ENOMEM]		The new process requires more virtual memory than is
			allowed by the imposed maximum (getrlimit(2)).

     [ENOTDIR]		A component of the path prefix is not a directory.

     [ETXTBSY]		The new process file is a pure procedure (shared text)
			file that is currently open for writing or reading by
			some process.

CAVEAT
     If a program is setuid to a non-super-user, but is executed when the real
     uid is ``root'', then the program has some of the powers of a super-user
     as well.

SEE ALSO
     exit(2), fork(2), execl(3), sysctl(3), environ(7)

HISTORY
     The execve() function call appeared in 4.2BSD.

BSD 4			       January 24, 1994 			 BSD 4
</pre>

</details><p>The separation and interface of <code>fork()</code> and <code>exec()</code> allows the <b>shell</b> to run code <i>after</i> forking, <b>but</b> <i>before</i> execing; giving it the ability to alter the environment of the program that is about to run. What happens in a shell is that after getting the command, it finds out where the executable resides, <code>fork()</code> s a new child process to run the command, runs <code>exec()</code> for the command and then <code>wait()</code> s for it to return. To illustrate: in <code>wc redir.c &gt; newfile.txt</code>, the output redirection happens by the shell closing <b>stdout</b> and opens <code>newfile.txt</code> before execing.
</p>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;string.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;fcntl.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/wait.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();
    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">fork failed; exit
</span>        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child (new process)
</span>        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child: redirect standard output to a file
</span>        close(STDOUT_FILENO);
        open(<span class="font-lock-string-face">"./newfile.txt"</span>, O_CREAT|O_WRONLY|O_TRUNC, S_IRWXU);

        <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">myargs</span>[3];
        myargs[0] = strdup(<span class="font-lock-string-face">"wc"</span>);
        myargs[1] = strdup(<span class="font-lock-string-face">"redir.c"</span>);
        myargs[2] = <span class="font-lock-constant-face">NULL</span>; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">marks end of array
</span>        execvp(myargs[0], myargs); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">runs `wc`
</span>    } <span class="font-lock-keyword-face">else</span> { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">parent goes down this path (main)
</span>        <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc_wait</span> = wait(<span class="font-lock-constant-face">NULL</span>);
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="src src-sh"><code>gcc -o redir redir.c
./redir
<span class="font-lock-builtin-face">wait</span>
cat newfile.txt
rm redir newfile.txt</code></pre>

<pre class="example">
27  97 786 redir.c
</pre>


<p>Other syscalls, such as <code>kill()</code> is used to <b>signal</b> to a process to pause, die etc. Some shell keys also sends these signals, for example: <code>C-c</code> sends <code>SIGINT</code> (interrupt, normal termination), <code>C-z</code> sends <code>SIGSTP</code> (stop, can <i>resume</i> with <code>fg</code>). This <code>signal()</code> subsystem allows for sending external events to processes. The process must &ldquo;catch&rdquo; these signals, suspend normal execution and run some code in response.
</p>
</div>
