docs/notes/ostep/process.html
<div id="outline-container-homework" class="outline-3">
<h3 id="homework">Homework</h3>
<div class="outline-text-3" id="text-homework">
<details>
<summary>fork.py</summary>

<pre class="src src-python"><code><span class="font-lock-comment-face">#! /usr/bin/env python3</span>

<span class="font-lock-comment-face"># from this sort of thing</span>
<span class="font-lock-comment-face"># a forks b</span>
<span class="font-lock-comment-face"># a forks c</span>
<span class="font-lock-comment-face"># a forks d</span>
<span class="font-lock-comment-face"># b forks e</span>
<span class="font-lock-comment-face"># b forks f</span>
<span class="font-lock-comment-face"># d forks g</span>

<span class="font-lock-comment-face"># to a process tree</span>
<span class="font-lock-comment-face">#a --- b --- e</span>
<span class="font-lock-comment-face">#   |     |</span>
<span class="font-lock-comment-face">#   |     |- f</span>
<span class="font-lock-comment-face">#   |- c</span>
<span class="font-lock-comment-face">#   |</span>
<span class="font-lock-comment-face">#   |- d --- g</span>


<span class="font-lock-keyword-face">from</span> __future__ <span class="font-lock-keyword-face">import</span> print_function
<span class="font-lock-keyword-face">import</span> random
<span class="font-lock-keyword-face">import</span> string
<span class="font-lock-keyword-face">from</span> optparse <span class="font-lock-keyword-face">import</span> <span class="font-lock-type-face">OptionParser</span>

<span class="font-lock-comment-face">#</span>
<span class="font-lock-comment-face"># to make Python2 and Python3 act the same -- how dumb</span>
<span class="font-lock-comment-face"># </span>
<span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">random_seed</span>(<span class="font-lock-variable-name-face">seed</span>):
    <span class="font-lock-keyword-face">try</span>:
        random.seed(seed, version=<span class="font-lock-number-face">1</span>)
    <span class="font-lock-keyword-face">except</span>:
        random.seed(seed)
    <span class="font-lock-keyword-face">return</span>

<span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">random_randint</span>(<span class="font-lock-variable-name-face">low</span>, <span class="font-lock-variable-name-face">hi</span>):
    <span class="font-lock-keyword-face">return</span> int(low + random.random() * (hi - low + <span class="font-lock-number-face">1</span>))

<span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">random_choice</span>(<span class="font-lock-variable-name-face">L</span>):
    <span class="font-lock-keyword-face">return</span> L[random_randint(<span class="font-lock-number-face">0</span>, <span class="font-lock-builtin-face">len</span>(L)-<span class="font-lock-number-face">1</span>)]

<span class="font-lock-comment-face">#</span>
<span class="font-lock-comment-face"># class Forker does all the work</span>
<span class="font-lock-comment-face">#</span>
<span class="font-lock-keyword-face">class</span> <span class="font-lock-type-face">Forker</span>:
    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">__init__</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">fork_percentage</span>, <span class="font-lock-variable-name-face">actions</span>, <span class="font-lock-variable-name-face">action_list</span>, <span class="font-lock-variable-name-face">show_tree</span>, <span class="font-lock-variable-name-face">just_final</span>,
                 <span class="font-lock-variable-name-face">leaf_only</span>, <span class="font-lock-variable-name-face">local_reparent</span>, <span class="font-lock-variable-name-face">print_style</span>, <span class="font-lock-variable-name-face">solve</span>):
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">fork_percentage</span> = fork_percentage
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">max_actions</span> = actions
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">action_list</span> = action_list
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">show_tree</span> = show_tree
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">just_final</span> = just_final
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">leaf_only</span> = leaf_only
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">local_reparent</span> = local_reparent
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">print_style</span> = print_style
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">solve</span> = solve

        <span class="font-lock-comment-face"># root process is always this</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">root_name</span> = <span class="font-lock-string-face">'a'</span>

        <span class="font-lock-comment-face"># process list: names of all active processes</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">process_list</span> = [<span class="font-lock-keyword-face">self</span>.root_name]

        <span class="font-lock-comment-face"># for each process, it's children</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">children</span> = {}
        <span class="font-lock-keyword-face">self</span>.children[<span class="font-lock-keyword-face">self</span>.root_name] = []

        <span class="font-lock-comment-face"># and track parents</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">parents</span> = {}

        <span class="font-lock-comment-face"># this is for pretty process names...</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">name_length</span> = <span class="font-lock-number-face">1</span>
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">base_names</span> = string.ascii_lowercase + string.ascii_uppercase
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_names</span> = <span class="font-lock-keyword-face">self</span>.base_names
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_index</span> = <span class="font-lock-number-face">1</span>

        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">grow_names</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-variable-name-face">new_names</span> = []
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">b1</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.curr_names:
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">b2</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.base_names:
                new_names.append(b1 + b2)
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_names</span> = new_names
        <span class="font-lock-keyword-face">self</span>.<span class="font-lock-variable-name-face">curr_index</span> = <span class="font-lock-number-face">0</span>
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">get_name</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.curr_index == <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.curr_names):
            <span class="font-lock-keyword-face">self</span>.grow_names()

        <span class="font-lock-variable-name-face">name</span> = <span class="font-lock-keyword-face">self</span>.curr_names[<span class="font-lock-keyword-face">self</span>.curr_index]
        <span class="font-lock-keyword-face">self</span>.curr_index += <span class="font-lock-number-face">1</span>
        <span class="font-lock-keyword-face">return</span> name

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">walk</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">p</span>, <span class="font-lock-variable-name-face">level</span>, <span class="font-lock-variable-name-face">pmask</span>, <span class="font-lock-variable-name-face">is_last</span>):
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'                               '</span>, end=<span class="font-lock-string-face">''</span>)
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.print_style == <span class="font-lock-string-face">'basic'</span>:
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">i</span> <span class="font-lock-keyword-face">in</span> range(level):
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'   '</span>, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%2s'</span> % p)
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">child</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.children[p]:
                <span class="font-lock-keyword-face">self</span>.walk(child, level + <span class="font-lock-number-face">1</span>, {}, <span class="font-lock-constant-face">False</span>)
            <span class="font-lock-keyword-face">return</span>
        <span class="font-lock-keyword-face">elif</span> <span class="font-lock-keyword-face">self</span>.print_style == <span class="font-lock-string-face">'line1'</span>:
            <span class="font-lock-variable-name-face">chars</span> = (<span class="font-lock-string-face">'|'</span>, <span class="font-lock-string-face">'-'</span>, <span class="font-lock-string-face">'+'</span>, <span class="font-lock-string-face">'|'</span>)
        <span class="font-lock-keyword-face">elif</span> <span class="font-lock-keyword-face">self</span>.print_style == <span class="font-lock-string-face">'line2'</span>:
            <span class="font-lock-variable-name-face">chars</span> = (<span class="font-lock-string-face">'|'</span>, <span class="font-lock-string-face">'_'</span>, <span class="font-lock-string-face">'|'</span>, <span class="font-lock-string-face">'|'</span>)
        <span class="font-lock-keyword-face">elif</span> <span class="font-lock-keyword-face">self</span>.print_style == <span class="font-lock-string-face">'fancy'</span>:
            <span class="font-lock-comment-face"># these characters taken from 'treelib', a fun printing package for trees</span>
            <span class="font-lock-comment-face"># https://github.com/caesar0301/treelib</span>
            <span class="font-lock-comment-face"># chars = ('\u2502', '\u2500', '\u251c', '\u2514')</span>
            <span class="font-lock-variable-name-face">chars</span> = (u<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\u2502</span><span class="font-lock-string-face">'</span>, u<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\u2500</span><span class="font-lock-string-face">'</span>, u<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\u251c</span><span class="font-lock-string-face">'</span>, u<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\u2514</span><span class="font-lock-string-face">'</span>)
        <span class="font-lock-keyword-face">else</span>:
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'bad style %s'</span> % <span class="font-lock-keyword-face">self</span>.print_style)
            exit(<span class="font-lock-number-face">1</span>)

        <span class="font-lock-comment-face"># print stuff before node</span>
        <span class="font-lock-keyword-face">if</span> level &gt; <span class="font-lock-number-face">0</span>:
            <span class="font-lock-comment-face"># main printing</span>
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">i</span> <span class="font-lock-keyword-face">in</span> range(level-<span class="font-lock-number-face">1</span>):
                <span class="font-lock-keyword-face">if</span> pmask[i]:
                    <span class="font-lock-comment-face"># '|  '</span>
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%s   '</span> % chars[<span class="font-lock-number-face">0</span>], end=<span class="font-lock-string-face">''</span>)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'    '</span>, end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">if</span> pmask[level-<span class="font-lock-number-face">1</span>]:
                <span class="font-lock-comment-face"># '|__'</span>
                <span class="font-lock-keyword-face">if</span> is_last:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%s%s%s '</span> % (chars[<span class="font-lock-number-face">3</span>], chars[<span class="font-lock-number-face">1</span>], chars[<span class="font-lock-number-face">1</span>]), end=<span class="font-lock-string-face">''</span>)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%s%s%s '</span> % (chars[<span class="font-lock-number-face">2</span>], chars[<span class="font-lock-number-face">1</span>], chars[<span class="font-lock-number-face">1</span>]), end=<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-comment-face"># '___' </span>
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">' %s%s%s '</span> % (chars[<span class="font-lock-number-face">1</span>], chars[<span class="font-lock-number-face">1</span>], chars[<span class="font-lock-number-face">1</span>]), end=<span class="font-lock-string-face">''</span>)

        <span class="font-lock-comment-face"># print node</span>
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'%s'</span> % p)

        <span class="font-lock-comment-face"># undo parent verticals</span>
        <span class="font-lock-keyword-face">if</span> is_last:
            pmask[level-<span class="font-lock-number-face">1</span>] = <span class="font-lock-constant-face">False</span>

        <span class="font-lock-comment-face"># recurse</span>
        pmask[level] = <span class="font-lock-constant-face">True</span>
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">child</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.children[p][:-<span class="font-lock-number-face">1</span>]:
            <span class="font-lock-keyword-face">self</span>.walk(child, level + <span class="font-lock-number-face">1</span>, pmask, <span class="font-lock-constant-face">False</span>)
        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">child</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.children[p][-<span class="font-lock-number-face">1</span>:]:
            <span class="font-lock-keyword-face">self</span>.walk(child, level + <span class="font-lock-number-face">1</span>, pmask, <span class="font-lock-constant-face">True</span>)
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">print_tree</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-keyword-face">self</span>.walk(<span class="font-lock-keyword-face">self</span>.root_name, <span class="font-lock-number-face">0</span>, {}, <span class="font-lock-constant-face">False</span>)

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">do_fork</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">p</span>, <span class="font-lock-variable-name-face">c</span>):
        <span class="font-lock-keyword-face">self</span>.process_list.append(c)
        <span class="font-lock-keyword-face">self</span>.children[c] = []
        <span class="font-lock-keyword-face">self</span>.children[p].append(c)
        <span class="font-lock-keyword-face">self</span>.parents[c] = p
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-string-face">'%s forks %s'</span> % (p, c)

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">collect_children</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">p</span>):
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.children[p] == []:
            <span class="font-lock-keyword-face">return</span> [p]
        <span class="font-lock-keyword-face">else</span>:
            <span class="font-lock-variable-name-face">L</span> = [p]
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">c</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.children[p]:
                <span class="font-lock-variable-name-face">L</span> += <span class="font-lock-keyword-face">self</span>.collect_children(c)
            <span class="font-lock-keyword-face">return</span> L

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">do_exit</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">p</span>):
        <span class="font-lock-comment-face"># remove the process from the process list</span>
        <span class="font-lock-keyword-face">if</span> p == <span class="font-lock-keyword-face">self</span>.root_name:
            <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'root process: cannot exit'</span>)
            exit(<span class="font-lock-number-face">1</span>)
        <span class="font-lock-variable-name-face">exit_parent</span> = <span class="font-lock-keyword-face">self</span>.parents[p]
        <span class="font-lock-keyword-face">self</span>.process_list.remove(p)

        <span class="font-lock-comment-face"># for each orphan, set its parent to exiting proc's parent or root</span>
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.local_reparent:
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">orphan</span> <span class="font-lock-keyword-face">in</span> <span class="font-lock-keyword-face">self</span>.children[p]:
                <span class="font-lock-keyword-face">self</span>.parents[orphan] = exit_parent
                <span class="font-lock-keyword-face">self</span>.children[exit_parent].append(orphan)
        <span class="font-lock-keyword-face">else</span>:
            <span class="font-lock-comment-face"># should set ALL descendants to be child of ROOT </span>
            <span class="font-lock-variable-name-face">descendents</span> = <span class="font-lock-keyword-face">self</span>.collect_children(p)
            descendents.remove(p)
            <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">d</span> <span class="font-lock-keyword-face">in</span> descendents:
                <span class="font-lock-keyword-face">self</span>.children[d] = []
                <span class="font-lock-keyword-face">self</span>.parents[d] = <span class="font-lock-keyword-face">self</span>.root_name
                <span class="font-lock-keyword-face">self</span>.children[<span class="font-lock-keyword-face">self</span>.root_name].append(d)

        <span class="font-lock-comment-face"># remove the entry from its parent child list</span>
        <span class="font-lock-keyword-face">self</span>.children[exit_parent].remove(p)
        <span class="font-lock-keyword-face">self</span>.children[p] = -<span class="font-lock-number-face">1</span> <span class="font-lock-comment-face"># should never be used again</span>
        <span class="font-lock-keyword-face">self</span>.parents[p] = -<span class="font-lock-number-face">1</span>  <span class="font-lock-comment-face"># should never be used again</span>

        <span class="font-lock-comment-face"># remove the entry for this proc from children</span>
        <span class="font-lock-keyword-face">return</span> <span class="font-lock-string-face">'%s EXITS'</span> % p

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">bad_action</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">action</span>):
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'bad action (%s), must be X+Y or X- where X and Y are processes'</span> % action)
        exit(<span class="font-lock-number-face">1</span>)
        <span class="font-lock-keyword-face">return</span>

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">check_legal</span>(<span class="font-lock-keyword-face">self</span>, <span class="font-lock-variable-name-face">action</span>):
        <span class="font-lock-keyword-face">if</span> <span class="font-lock-string-face">'+'</span> <span class="font-lock-keyword-face">in</span> action:
            <span class="font-lock-variable-name-face">tmp</span> = action.split(<span class="font-lock-string-face">'+'</span>)
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(tmp) != <span class="font-lock-number-face">2</span>:
                <span class="font-lock-keyword-face">self</span>.bad_action(action)
            <span class="font-lock-keyword-face">return</span> [tmp[<span class="font-lock-number-face">0</span>], tmp[<span class="font-lock-number-face">1</span>]]
        <span class="font-lock-keyword-face">elif</span> <span class="font-lock-string-face">'-'</span> <span class="font-lock-keyword-face">in</span> action:
            <span class="font-lock-variable-name-face">tmp</span> = action.split(<span class="font-lock-string-face">'-'</span>)
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(tmp) != <span class="font-lock-number-face">2</span>:
                <span class="font-lock-keyword-face">self</span>.bad_action(action)
            <span class="font-lock-keyword-face">return</span> [tmp[<span class="font-lock-number-face">0</span>]]
        <span class="font-lock-keyword-face">else</span>:
            <span class="font-lock-keyword-face">self</span>.bad_action(action)
        <span class="font-lock-keyword-face">return</span> 

    <span class="font-lock-keyword-face">def</span> <span class="font-lock-function-name-face">run</span>(<span class="font-lock-keyword-face">self</span>):
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'                           Process Tree:'</span>)
        <span class="font-lock-keyword-face">self</span>.print_tree()
        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)

        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.action_list != <span class="font-lock-string-face">''</span>:
            <span class="font-lock-comment-face"># use specific action list</span>
            <span class="font-lock-variable-name-face">action_list</span> = <span class="font-lock-keyword-face">self</span>.action_list.split(<span class="font-lock-string-face">','</span>)
        <span class="font-lock-keyword-face">else</span>:
            <span class="font-lock-variable-name-face">action_list</span> = []
            <span class="font-lock-variable-name-face">actions</span> = <span class="font-lock-number-face">0</span>
            <span class="font-lock-variable-name-face">temp_process_list</span> = [<span class="font-lock-keyword-face">self</span>.root_name]
            <span class="font-lock-variable-name-face">level_list</span> = {}
            level_list[<span class="font-lock-keyword-face">self</span>.root_name] = <span class="font-lock-number-face">1</span>

            <span class="font-lock-comment-face"># this got a little yucky, too much re-doing of the work</span>
            <span class="font-lock-keyword-face">while</span> actions &lt; <span class="font-lock-keyword-face">self</span>.max_actions:
                <span class="font-lock-keyword-face">if</span> random.random() &lt; <span class="font-lock-keyword-face">self</span>.fork_percentage:
                    <span class="font-lock-comment-face"># FORK:: pick random parent, add child to it</span>
                    <span class="font-lock-variable-name-face">fork_choice</span> = random_choice(temp_process_list)
                    <span class="font-lock-variable-name-face">new_child</span> = <span class="font-lock-keyword-face">self</span>.get_name()
                    action_list.append(<span class="font-lock-string-face">'%s+%s'</span> % (fork_choice, new_child))
                    temp_process_list.append(new_child)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-comment-face"># EXIT:: pick random child, remove it</span>
                    <span class="font-lock-comment-face">#        exception: no killing root process, sorry</span>
                    <span class="font-lock-variable-name-face">exit_choice</span> = random_choice(temp_process_list)
                    <span class="font-lock-keyword-face">if</span> exit_choice == <span class="font-lock-keyword-face">self</span>.root_name:
                        <span class="font-lock-keyword-face">continue</span>
                    temp_process_list.remove(exit_choice)
                    action_list.append(<span class="font-lock-string-face">'%s-'</span> % exit_choice)
                <span class="font-lock-variable-name-face">actions</span> += <span class="font-lock-number-face">1</span>

        <span class="font-lock-keyword-face">for</span> <span class="font-lock-variable-name-face">a</span> <span class="font-lock-keyword-face">in</span> action_list:
            <span class="font-lock-variable-name-face">tmp</span> = <span class="font-lock-keyword-face">self</span>.check_legal(a)
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-builtin-face">len</span>(tmp) == <span class="font-lock-number-face">2</span>:
                <span class="font-lock-variable-name-face">fork_choice</span>, <span class="font-lock-variable-name-face">new_child</span> = tmp[<span class="font-lock-number-face">0</span>], tmp[<span class="font-lock-number-face">1</span>]
                <span class="font-lock-keyword-face">if</span> fork_choice <span class="font-lock-keyword-face">not in</span> <span class="font-lock-keyword-face">self</span>.process_list:
                    <span class="font-lock-keyword-face">self</span>.bad_action(a)
                <span class="font-lock-variable-name-face">action</span> = <span class="font-lock-keyword-face">self</span>.do_fork(fork_choice, new_child)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-variable-name-face">exit_choice</span> = tmp[<span class="font-lock-number-face">0</span>]
                <span class="font-lock-keyword-face">if</span> exit_choice <span class="font-lock-keyword-face">not in</span> <span class="font-lock-keyword-face">self</span>.process_list:
                    <span class="font-lock-keyword-face">self</span>.bad_action(a)
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.leaf_only <span class="font-lock-keyword-face">and</span> <span class="font-lock-builtin-face">len</span>(<span class="font-lock-keyword-face">self</span>.children[exit_choice]) &gt; <span class="font-lock-number-face">0</span>:
                    <span class="font-lock-variable-name-face">action</span> = <span class="font-lock-string-face">'%s EXITS (failed: has children)'</span> % exit_choice
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-variable-name-face">action</span> = <span class="font-lock-keyword-face">self</span>.do_exit(exit_choice)

            <span class="font-lock-comment-face"># if we got here, we actually did an action...</span>
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.show_tree:
                <span class="font-lock-comment-face"># SHOW TREES (guess actions)</span>
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.solve:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Action:'</span>, action)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Action?'</span>)
                <span class="font-lock-comment-face"># print('Process Tree:')</span>
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">not</span> <span class="font-lock-keyword-face">self</span>.just_final:
                    <span class="font-lock-keyword-face">self</span>.print_tree()
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-comment-face"># SHOW ACTIONS (guess tree)</span>
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Action:'</span>, action)
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">not</span> <span class="font-lock-keyword-face">self</span>.just_final:
                    <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.solve:
                        <span class="font-lock-comment-face"># print('Process Tree:')</span>
                        <span class="font-lock-keyword-face">self</span>.print_tree()
                    <span class="font-lock-keyword-face">else</span>:
                        <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'Process Tree?'</span>)

        <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.just_final:
            <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.show_tree:
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\n</span><span class="font-lock-string-face">                        Final Process Tree:'</span>)
                <span class="font-lock-keyword-face">self</span>.print_tree()
                <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
            <span class="font-lock-keyword-face">else</span>:
                <span class="font-lock-keyword-face">if</span> <span class="font-lock-keyword-face">self</span>.solve:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\n</span><span class="font-lock-string-face">                        Final Process Tree:'</span>)
                    <span class="font-lock-keyword-face">self</span>.print_tree()
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
                <span class="font-lock-keyword-face">else</span>:
                    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'</span><span class="font-lock-escape-face">\n</span><span class="font-lock-string-face">                        Final Process Tree?</span><span class="font-lock-escape-face">\n</span><span class="font-lock-string-face">'</span>)

        <span class="font-lock-keyword-face">return</span>


<span class="font-lock-comment-face">#</span>
<span class="font-lock-comment-face"># main</span>
<span class="font-lock-comment-face">#</span>

<span class="font-lock-variable-name-face">parser</span> = <span class="font-lock-type-face">OptionParser</span>()
parser.add_option(<span class="font-lock-string-face">'-s'</span>, <span class="font-lock-string-face">'--seed'</span>, default=-<span class="font-lock-number-face">1</span>, help=<span class="font-lock-string-face">'the random seed'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'int'</span>, dest=<span class="font-lock-string-face">'seed'</span>)
parser.add_option(<span class="font-lock-string-face">'-f'</span>, <span class="font-lock-string-face">'--forks'</span>, default=<span class="font-lock-number-face">0.7</span>, help=<span class="font-lock-string-face">'percent of actions that are forks (not exits)'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'float'</span>, dest=<span class="font-lock-string-face">'fork_percentage'</span>)
parser.add_option(<span class="font-lock-string-face">'-A'</span>, <span class="font-lock-string-face">'--action_list'</span>, default=<span class="font-lock-string-face">''</span>, help=<span class="font-lock-string-face">'action list, instead of randomly generated ones (format: a+b,b+c,b- means a fork b, b fork c, b exit)'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, dest=<span class="font-lock-string-face">'action_list'</span>)
parser.add_option(<span class="font-lock-string-face">'-a'</span>, <span class="font-lock-string-face">'--actions'</span>, default=<span class="font-lock-number-face">5</span>, help=<span class="font-lock-string-face">'number of forks/exits to do'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'int'</span>, dest=<span class="font-lock-string-face">'actions'</span>)
parser.add_option(<span class="font-lock-string-face">'-t'</span>, <span class="font-lock-string-face">'--show_tree'</span>, help=<span class="font-lock-string-face">'show tree (not actions)'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'show_tree'</span>)
parser.add_option(<span class="font-lock-string-face">'-P'</span>, <span class="font-lock-string-face">'--print_style'</span>, help=<span class="font-lock-string-face">'tree print style (basic, line1, line2, fancy)'</span>, action=<span class="font-lock-string-face">'store'</span>, type=<span class="font-lock-string-face">'string'</span>, default=<span class="font-lock-string-face">'fancy'</span>, dest=<span class="font-lock-string-face">'print_style'</span>)
parser.add_option(<span class="font-lock-string-face">'-F'</span>, <span class="font-lock-string-face">'--final_only'</span>, help=<span class="font-lock-string-face">'just show final state'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'just_final'</span>)
parser.add_option(<span class="font-lock-string-face">'-L'</span>, <span class="font-lock-string-face">'--leaf_only'</span>, help=<span class="font-lock-string-face">'only leaf processes exit'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'leaf_only'</span>)
parser.add_option(<span class="font-lock-string-face">'-R'</span>, <span class="font-lock-string-face">'--local_reparent'</span>, help=<span class="font-lock-string-face">'reparent to local parent'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'local_reparent'</span>)
parser.add_option(<span class="font-lock-string-face">'-c'</span>, <span class="font-lock-string-face">'--compute'</span>, help=<span class="font-lock-string-face">'compute answers for me'</span>, action=<span class="font-lock-string-face">'store_true'</span>, default=<span class="font-lock-constant-face">False</span>, dest=<span class="font-lock-string-face">'solve'</span>)

(<span class="font-lock-variable-name-face">options</span>, <span class="font-lock-variable-name-face">args</span>) = parser.parse_args()

<span class="font-lock-keyword-face">if</span> options.seed != -<span class="font-lock-number-face">1</span>:
    random_seed(options.seed)

<span class="font-lock-keyword-face">if</span> options.fork_percentage &lt;= <span class="font-lock-number-face">0.001</span>:
    <span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'fork_percentage must be &gt; 0.001'</span>)
    exit(<span class="font-lock-number-face">1</span>)

<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG seed'</span>, options.seed)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG fork_percentage'</span>, options.fork_percentage)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG actions'</span>, options.actions)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG action_list'</span>, options.action_list)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG show_tree'</span>, options.show_tree)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG just_final'</span>, options.just_final)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG leaf_only'</span>, options.leaf_only)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG local_reparent'</span>, options.local_reparent)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG print_style'</span>, options.print_style)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">'ARG solve'</span>, options.solve)
<span class="font-lock-builtin-face">print</span>(<span class="font-lock-string-face">''</span>)

<span class="font-lock-variable-name-face">f</span> = <span class="font-lock-type-face">Forker</span>(options.fork_percentage, options.actions, options.action_list, options.show_tree, options.just_final, options.leaf_only, options.local_reparent, options.print_style, options.solve)
f.run()</code></pre>
</details>

<pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-s is for specifying the seed
</span>python fork.py -s 10 -c</code></pre>

<details>
<summary>Output</summary>
<pre class="example">

ARG seed 10
ARG fork_percentage 0.7
ARG actions 5
ARG action_list 
ARG show_tree False
ARG just_final False
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve True

                           Process Tree:
                               a

Action: a forks b
                               a
                               └── b
Action: a forks c
                               a
                               ├── b
                               └── c
Action: c EXITS
                               a
                               └── b
Action: a forks d
                               a
                               ├── b
                               └── d
Action: a forks e
                               a
                               ├── b
                               ├── d
                               └── e
</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-f is for controlling the fork percentage
</span>python fork.py -a 20 -f 0.1 -c
<span class="font-lock-builtin-face">echo</span> <span class="font-lock-string-face">"------------------------"</span>
python fork.py -a 20 -f 0.9 -c</code></pre>

<details>
<summary>Output</summary>
<pre class="example">

ARG seed -1
ARG fork_percentage 0.1
ARG actions 20
ARG action_list 
ARG show_tree False
ARG just_final False
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve True

                           Process Tree:
                               a

Action: a forks b
                               a
                               └── b
Action: b EXITS
                               a
Action: a forks c
                               a
                               └── c
Action: c forks d
                               a
                               └── c
                                   └── d
Action: d EXITS
                               a
                               └── c
Action: c EXITS
                               a
Action: a forks e
                               a
                               └── e
Action: e EXITS
                               a
Action: a forks f
                               a
                               └── f
Action: f EXITS
                               a
Action: a forks g
                               a
                               └── g
Action: g EXITS
                               a
Action: a forks h
                               a
                               └── h
Action: h EXITS
                               a
Action: a forks i
                               a
                               └── i
Action: i EXITS
                               a
Action: a forks j
                               a
                               └── j
Action: j EXITS
                               a
Action: a forks k
                               a
                               └── k
Action: k EXITS
                               a
------------------------

ARG seed -1
ARG fork_percentage 0.9
ARG actions 20
ARG action_list 
ARG show_tree False
ARG just_final False
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve True

                           Process Tree:
                               a

Action: a forks b
                               a
                               └── b
Action: b forks c
                               a
                               └── b
                                   └── c
Action: a forks d
                               a
                               ├── b
                               │   └── c
                               └── d
Action: c forks e
                               a
                               ├── b
                               │   └── c
                               │       └── e
                               └── d
Action: c forks f
                               a
                               ├── b
                               │   └── c
                               │       ├── e
                               │       └── f
                               └── d
Action: c forks g
                               a
                               ├── b
                               │   └── c
                               │       ├── e
                               │       ├── f
                               │       └── g
                               └── d
Action: b forks h
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   ├── f
                               │   │   └── g
                               │   └── h
                               └── d
Action: a forks i
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   ├── f
                               │   │   └── g
                               │   └── h
                               ├── d
                               └── i
Action: c forks j
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   ├── f
                               │   │   ├── g
                               │   │   └── j
                               │   └── h
                               ├── d
                               └── i
Action: j forks k
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   ├── f
                               │   │   ├── g
                               │   │   └── j
                               │   │       └── k
                               │   └── h
                               ├── d
                               └── i
Action: e forks l
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   ├── g
                               │   │   └── j
                               │   │       └── k
                               │   └── h
                               ├── d
                               └── i
Action: j EXITS
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   └── h
                               ├── d
                               ├── i
                               └── k
Action: i forks m
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   └── h
                               ├── d
                               ├── i
                               │   └── m
                               └── k
Action: g forks n
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       └── n
                               │   └── h
                               ├── d
                               ├── i
                               │   └── m
                               └── k
Action: h forks o
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       └── n
                               │   └── h
                               │       └── o
                               ├── d
                               ├── i
                               │   └── m
                               └── k
Action: i forks p
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       └── n
                               │   └── h
                               │       └── o
                               ├── d
                               ├── i
                               │   ├── m
                               │   └── p
                               └── k
Action: g forks q
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       ├── n
                               │   │       └── q
                               │   └── h
                               │       └── o
                               ├── d
                               ├── i
                               │   ├── m
                               │   └── p
                               └── k
Action: a forks r
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       ├── n
                               │   │       └── q
                               │   └── h
                               │       └── o
                               ├── d
                               ├── i
                               │   ├── m
                               │   └── p
                               ├── k
                               └── r
Action: b forks s
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       ├── n
                               │   │       └── q
                               │   ├── h
                               │   │   └── o
                               │   └── s
                               ├── d
                               ├── i
                               │   ├── m
                               │   └── p
                               ├── k
                               └── r
Action: n forks t
                               a
                               ├── b
                               │   ├── c
                               │   │   ├── e
                               │   │   │   └── l
                               │   │   ├── f
                               │   │   └── g
                               │   │       ├── n
                               │   │       │   └── t
                               │   │       └── q
                               │   ├── h
                               │   │   └── o
                               │   └── s
                               ├── d
                               ├── i
                               │   ├── m
                               │   └── p
                               ├── k
                               └── r
</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-t is for showing the process tree and not actions
</span>python fork.py -t</code></pre>

<details>
<summary>Output</summary>
<pre class="example">

ARG seed -1
ARG fork_percentage 0.7
ARG actions 5
ARG action_list 
ARG show_tree True
ARG just_final False
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve False

                           Process Tree:
                               a

Action?
                               a
                               └── b
Action?
                               a
                               ├── b
                               └── c
Action?
                               a
                               ├── b
                               └── c
                                   └── d
Action?
                               a
                               ├── b
                               └── c
Action?
                               a
                               └── c
</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-A action list: a+b =&gt; a fork b; b- =&gt; b exit
</span>python fork.py -A a+b,b+c,c+d,c+e,c- -c

<span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">even though c exits, d &amp; e are running with a as parent
</span>
<span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-R reparents to local parent i.e. b
</span>python fork.py -A a+b,b+c,c+d,c+e,c- -R -c</code></pre>

<details>
<summary>Output</summary>
<pre class="example">

ARG seed -1
ARG fork_percentage 0.7
ARG actions 5
ARG action_list a+b,b+c,c+d,c+e,c-
ARG show_tree False
ARG just_final False
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve True

                           Process Tree:
                               a

Action: a forks b
                               a
                               └── b
Action: b forks c
                               a
                               └── b
                                   └── c
Action: c forks d
                               a
                               └── b
                                   └── c
                                       └── d
Action: c forks e
                               a
                               └── b
                                   └── c
                                       ├── d
                                       └── e
Action: c EXITS
                               a
                               ├── b
                               ├── d
                               └── e

ARG seed -1
ARG fork_percentage 0.7
ARG actions 5
ARG action_list a+b,b+c,c+d,c+e,c-
ARG show_tree False
ARG just_final False
ARG leaf_only False
ARG local_reparent True
ARG print_style fancy
ARG solve True

                           Process Tree:
                               a

Action: a forks b
                               a
                               └── b
Action: b forks c
                               a
                               └── b
                                   └── c
Action: c forks d
                               a
                               └── b
                                   └── c
                                       └── d
Action: c forks e
                               a
                               └── b
                                   └── c
                                       ├── d
                                       └── e
Action: c EXITS
                               a
                               └── b
                                   ├── d
                                   └── e
</pre>

</details><pre class="src src-sh"><code><span class="font-lock-comment-delimiter-face"># </span><span class="font-lock-comment-face">-F skip intermediate steps, show final tree
</span>python fork.py -t -F</code></pre>

<details>
<summary>Output</summary>
<pre class="example">

ARG seed -1
ARG fork_percentage 0.7
ARG actions 5
ARG action_list 
ARG show_tree True
ARG just_final True
ARG leaf_only False
ARG local_reparent False
ARG print_style fancy
ARG solve False

                           Process Tree:
                               a

Action?
Action?
Action?
Action?
Action?

                        Final Process Tree:
                               a
                               ├── b
                               └── d
                                   └── e

</pre>

</details>
</div>
</div>
