org/notes/ostep/process.org
** Code Homework

Write a program that calls fork while setting a variable value, what happens to variable when both child and parent change this value?

#+begin_details
#+begin_summary
p1.C
#+end_summary

#+begin_src C :results output :exports both
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

int main(int argc, char *argv[]) {
    int x = 100;
    printf("hello, x is '%d' (pid: %d)\n", x, (int) getpid());
    fflush(stdout);
    int rc = fork();

    x += 5;
    if (rc < 0) { // fork failed
        fprintf(stderr, "fork failed\n");
        exit(1);
    } else if (rc == 0) { // child (new process)
        x -= 10;
        printf("hello, I am child, x is '%d' (pid: %d)\n", x, (int) getpid());
    } else { // parent goes down this path (main)
        printf("hello, I am parent of %d, x is '%d' (pid: %d)\n", rc, x, (int) getpid());
    }
    return 0;
}
#+end_src

#+RESULTS:
: hello, x is '100' (pid: 90319)
: hello, I am parent of 90320, x is '105' (pid: 90319)
: hello, I am child, x is '95' (pid: 90320)
#+end_details

Write a program that opens a file and then forks. Can child and parent access ~fd~ returned by ~open()~? What happens when both write to file concurrently? How to ensure child process prints before parent, can it be done without using wait()?

#+begin_details
#+begin_summary
p2-p3.C
#+end_summary

#+begin_src C :results output :exports both
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <sys/types.h>
#include <assert.h>

int main(int argc, char *argv[]) {
    int fd = open("/tmp/file_ostep", O_WRONLY|O_CREAT|O_TRUNC, S_IRWXU);
    assert(fd > -1);

    printf("hello, fd is '%d' (pid: %d)\n", fd, (int) getpid());
    fflush(stdout);
    
    int rc = fork();

    if (rc < 0) {
        fprintf(stderr, "fork failed\n");
        exit(1);
    } else if (rc == 0) {
        int rcw = write(fd, "hello from child\n", 17); // 17 = nbyte
        assert(rcw == 17);
        printf("hello, I am child, rc is '%d', rcw is '%d' (pid: %d)\n",
               rc, rcw, (int) getpid());
    } else {
        // wait(NULL);
        sleep(2); // To ensure child writes first without using `wait()`
        int rcw = write(fd, "goodbye from parent\n", 20); // 20 = nbyte
        assert(rcw == 20);
        printf("hello, I am parent of %d, rcw is '%d', (pid: %d)\n",
               rc, rcw, (int) getpid());
    }
    close(fd);
    return 0;
}
#+end_src

#+RESULTS:
: hello, fd is '3' (pid: 18508)
: hello, I am child, rc is '0', rcw is '17' (pid: 18509)
: hello, I am parent of 18509, rcw is '20', (pid: 18508)

#+begin_src sh :results output :exports both
cat /tmp/file_ostep
#+end_src

#+RESULTS:
: hello from child
: goodbye from parent
#+end_details

Write program that forks, then calls various variants of ~exec()~ to run ~/bin/ls~.

#+begin_details
#+begin_summary
p4.C
#+end_summary

#+begin_src C :results output :exports both
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

int main(int argc, char *argv[]) {
    int rc = fork();

    if (rc < 0) {
        fprintf(stderr, "fork failed\n");
        exit(1);
    } else if (rc == 0) {
        printf("hello, I am child, rc is '%d' (pid: %d)\n", rc, (int) getpid());

        char * args[] = {"ls", "-l", NULL}; // List of pointers to null-terminated strings
        char * env[] = {NULL}; // Environment of exectured process
        execl("/bin/ls", "ls", "-l", (char *) 0);
        execv("/bin/ls", args);
        execle("/bin/ls", "ls", "-l", (char *) 0, env);
        execve("/bin/ls", args, env);
        execlp("ls", "ls", "-l", (char *) 0);
        execvp("ls", args);
    } else {
        printf("hello, I am parent of %d, (pid: %d)\n", rc, (int) getpid());
    }
    return 0;
}
#+end_src

#+RESULTS:
: hello, I am parent of 29461, (pid: 29460)
: total 352
: -rw-r--r--@ 1 IABDCEF  staff  12109  2 Mar 23:35 fork.py
: -rw-r--r--@ 1 IABDCEF  staff  14194 19 Feb 01:52 intro.org
: -rwx------@ 1 IABDCEF  staff     20  2 Mar 17:59 newfile.txt
: -rw-r--r--@ 1 IABDCEF  staff  13351  2 Mar 12:14 process-run.py
: -rw-r--r--@ 1 IABDCEF  staff  88866  3 Mar 02:33 process.org
: -rwxr-xr-x@ 1 IABDCEF  staff  33896  2 Mar 17:59 redir
: -rw-r--r--@ 1 IABDCEF  staff    786  2 Mar 17:59 redir.c

#+end_details
