docs/notes/ostep/process.html
<div id="outline-container-code-homework" class="outline-3">
<h3 id="code-homework">Code Homework</h3>
<div class="outline-text-3" id="text-code-homework">
<p>Write a program that calls fork while setting a variable value, what happens to variable when both child and parent change this value?
</p>

<details>
<summary>p1.C</summary>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">x</span> = 100;
    printf(<span class="font-lock-string-face">"hello, x is '%d' (pid: %d)\n"</span>, x, (<span class="font-lock-type-face">int</span>) getpid());
    fflush(stdout);
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();

    x += 5;
    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">fork failed
</span>        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">child (new process)
</span>        x -= 10;
        printf(<span class="font-lock-string-face">"hello, I am child, x is '%d' (pid: %d)\n"</span>, x, (<span class="font-lock-type-face">int</span>) getpid());
    } <span class="font-lock-keyword-face">else</span> { <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">parent goes down this path (main)
</span>        printf(<span class="font-lock-string-face">"hello, I am parent of %d, x is '%d' (pid: %d)\n"</span>, rc, x, (<span class="font-lock-type-face">int</span>) getpid());
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello, x is '100' (pid: 90319)
hello, I am parent of 90320, x is '105' (pid: 90319)
hello, I am child, x is '95' (pid: 90320)
</pre>
</details>

<p>Write a program that opens a file and then forks. Can child and parent access <code>fd</code> returned by <code>open()</code>? What happens when both write to file concurrently? How to ensure child process prints before parent, can it be done without using wait()?
</p>

<details>
<summary>p2-p3.C</summary>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;fcntl.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;sys/types.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;assert.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">fd</span> = open(<span class="font-lock-string-face">"/tmp/file_ostep"</span>, O_WRONLY|O_CREAT|O_TRUNC, S_IRWXU);
    assert(fd &gt; -1);

    printf(<span class="font-lock-string-face">"hello, fd is '%d' (pid: %d)\n"</span>, fd, (<span class="font-lock-type-face">int</span>) getpid());
    fflush(stdout);

    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();

    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) {
        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) {
        <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rcw</span> = write(fd, <span class="font-lock-string-face">"hello from child\n"</span>, 17); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">17 = nbyte
</span>        assert(rcw == 17);
        printf(<span class="font-lock-string-face">"hello, I am child, rc is '%d', rcw is '%d' (pid: %d)\n"</span>,
               rc, rcw, (<span class="font-lock-type-face">int</span>) getpid());
    } <span class="font-lock-keyword-face">else</span> {
        <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">wait(NULL);
</span>        sleep(2); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">To ensure child writes first without using `wait()`
</span>        <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rcw</span> = write(fd, <span class="font-lock-string-face">"goodbye from parent\n"</span>, 20); <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">20 = nbyte
</span>        assert(rcw == 20);
        printf(<span class="font-lock-string-face">"hello, I am parent of %d, rcw is '%d', (pid: %d)\n"</span>,
               rc, rcw, (<span class="font-lock-type-face">int</span>) getpid());
    }
    close(fd);
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello, fd is '3' (pid: 18508)
hello, I am child, rc is '0', rcw is '17' (pid: 18509)
hello, I am parent of 18509, rcw is '20', (pid: 18508)
</pre>


<pre class="src src-sh"><code>cat /tmp/file_ostep</code></pre>

<pre class="example">
hello from child
goodbye from parent
</pre>
</details>

<p>Write program that forks, then calls various variants of <code>exec()</code> to run <code>/bin/ls</code>.
</p>

<details>
<summary>p4.C</summary>

<pre class="src src-C"><code><span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdio.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;stdlib.h&gt;</span>
<span class="font-lock-preprocessor-face">#include</span> <span class="font-lock-string-face">&lt;unistd.h&gt;</span>

<span class="font-lock-type-face">int</span> <span class="font-lock-function-name-face">main</span>(<span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">argc</span>, <span class="font-lock-type-face">char</span> *<span class="font-lock-variable-name-face">argv</span>[]) {
    <span class="font-lock-type-face">int</span> <span class="font-lock-variable-name-face">rc</span> = fork();

    <span class="font-lock-keyword-face">if</span> (rc &lt; 0) {
        fprintf(stderr, <span class="font-lock-string-face">"fork failed\n"</span>);
        exit(1);
    } <span class="font-lock-keyword-face">else</span> <span class="font-lock-keyword-face">if</span> (rc == 0) {
        printf(<span class="font-lock-string-face">"hello, I am child, rc is '%d' (pid: %d)\n"</span>, rc, (<span class="font-lock-type-face">int</span>) getpid());

        <span class="font-lock-type-face">char</span> * <span class="font-lock-variable-name-face">args</span>[] = {<span class="font-lock-string-face">"ls"</span>, <span class="font-lock-string-face">"-l"</span>, <span class="font-lock-constant-face">NULL</span>}; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">List of pointers to null-terminated strings
</span>        <span class="font-lock-type-face">char</span> * <span class="font-lock-variable-name-face">env</span>[] = {<span class="font-lock-constant-face">NULL</span>}; <span class="font-lock-comment-delimiter-face">// </span><span class="font-lock-comment-face">Environment of exectured process
</span>        execl(<span class="font-lock-string-face">"/bin/ls"</span>, <span class="font-lock-string-face">"ls"</span>, <span class="font-lock-string-face">"-l"</span>, (<span class="font-lock-type-face">char</span> *) 0);
        execv(<span class="font-lock-string-face">"/bin/ls"</span>, args);
        execle(<span class="font-lock-string-face">"/bin/ls"</span>, <span class="font-lock-string-face">"ls"</span>, <span class="font-lock-string-face">"-l"</span>, (<span class="font-lock-type-face">char</span> *) 0, env);
        execve(<span class="font-lock-string-face">"/bin/ls"</span>, args, env);
        execlp(<span class="font-lock-string-face">"ls"</span>, <span class="font-lock-string-face">"ls"</span>, <span class="font-lock-string-face">"-l"</span>, (<span class="font-lock-type-face">char</span> *) 0);
        execvp(<span class="font-lock-string-face">"ls"</span>, args);
    } <span class="font-lock-keyword-face">else</span> {
        printf(<span class="font-lock-string-face">"hello, I am parent of %d, (pid: %d)\n"</span>, rc, (<span class="font-lock-type-face">int</span>) getpid());
    }
    <span class="font-lock-keyword-face">return</span> 0;
}</code></pre>

<pre class="example">
hello, I am parent of 29461, (pid: 29460)
total 352
-rw-r--r--@ 1 IABDCEF  staff  12109  2 Mar 23:35 fork.py
-rw-r--r--@ 1 IABDCEF  staff  14194 19 Feb 01:52 intro.org
-rwx------@ 1 IABDCEF  staff     20  2 Mar 17:59 newfile.txt
-rw-r--r--@ 1 IABDCEF  staff  13351  2 Mar 12:14 process-run.py
-rw-r--r--@ 1 IABDCEF  staff  88866  3 Mar 02:33 process.org
-rwxr-xr-x@ 1 IABDCEF  staff  33896  2 Mar 17:59 redir
-rw-r--r--@ 1 IABDCEF  staff    786  2 Mar 17:59 redir.c
</pre>
</details>
</div>
</div>
</div>
</div>
<footer id="postamble" class="status">
&copy; 2026 . Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</footer>
</body>
</html>
